Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
/*
 * Copyright 2023-2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_xspi.h"
#include "fsl_cache.h"

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.xspi"
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#define FREQ_1MHz        (1000000UL)
#define XSPI_LUT_KEY_VAL (0x5AF05AF0UL)


/* XSPI FSM status. */
enum
{
    kXSPI_TransactionIsGrantedXSPIsBusy = 0x0U, /*!< Transaction is granted, but XSPI is busy
                                                  with any previous DMA transaction is ongoing*/
    kXSPI_TbdrLockIsOpen           = 0x1U,      /*!< TBDR lock is open. IPS master can write in TBDR.*/
    kXSPI_WriteTransferIsTriggered = 0x2U,      /*!< Write transfer is triggered. SEQID is written to XSPI.*/
    kXSPI_ReadTransferIsTriggered  = 0x3U,      /*!< Read transfer is triggered. SEQID is written to XSPI.*/
};

/* XSPI transfer state, _xspi_transfer_state. */
typedef enum _xspi_transfer_state
{
    kXSPI_StateIdle      = 0x0U, /*!< Transfer is done. */
    kXSPI_StateBusyWrite = 0x1U, /*!< XSPI is busy write transfer. */
    kXSPI_StateBusyRead  = 0x2U, /*!< XSPI is busy write transfer. */
    kXSPI_StateStartIpAccess,
    kXSPI_StateIpAccessGranted,
} xspi_transfer_state_t;

/*! brief Typedef for interrupt handler. */
typedef void (*xspi_isr_t)(XSPI_Type *base, xspi_handle_t *handle);

#define XSPI_TG_MDAD_REG_OFFSET_ARRAY                                                   \
    {                                                                                   \
        (uint32_t) offsetof(XSPI_Type, TG0MDAD), (uint32_t)offsetof(XSPI_Type, TG1MDAD) \
    }

#define XSPI_FRAD_WORD0_REG_OFFSET_ARRAY                                                            \
    {                                                                                               \
        (uint32_t) offsetof(XSPI_Type, FRAD0_WORD0), (uint32_t)offsetof(XSPI_Type, FRAD1_WORD0),    \
            (uint32_t)offsetof(XSPI_Type, FRAD2_WORD0), (uint32_t)offsetof(XSPI_Type, FRAD3_WORD0), \
            (uint32_t)offsetof(XSPI_Type, FRAD4_WORD0), (uint32_t)offsetof(XSPI_Type, FRAD5_WORD0), \
            (uint32_t)offsetof(XSPI_Type, FRAD6_WORD0), (uint32_t)offsetof(XSPI_Type, FRAD7_WORD0), \
    }

#define XSPI_FRAD_WORD1_REG_OFFSET_ARRAY                                                            \
    {                                                                                               \
        (uint32_t) offsetof(XSPI_Type, FRAD0_WORD1), (uint32_t)offsetof(XSPI_Type, FRAD1_WORD1),    \
            (uint32_t)offsetof(XSPI_Type, FRAD2_WORD1), (uint32_t)offsetof(XSPI_Type, FRAD3_WORD1), \
            (uint32_t)offsetof(XSPI_Type, FRAD4_WORD1), (uint32_t)offsetof(XSPI_Type, FRAD5_WORD1), \
            (uint32_t)offsetof(XSPI_Type, FRAD6_WORD1), (uint32_t)offsetof(XSPI_Type, FRAD7_WORD1), \
    }

#define XSPI_FRAD_WORD2_REG_OFFSET_ARRAY                                                            \
    {                                                                                               \
        (uint32_t) offsetof(XSPI_Type, FRAD0_WORD2), (uint32_t)offsetof(XSPI_Type, FRAD1_WORD2),    \
            (uint32_t)offsetof(XSPI_Type, FRAD2_WORD2), (uint32_t)offsetof(XSPI_Type, FRAD3_WORD2), \
            (uint32_t)offsetof(XSPI_Type, FRAD4_WORD2), (uint32_t)offsetof(XSPI_Type, FRAD5_WORD2), \
            (uint32_t)offsetof(XSPI_Type, FRAD6_WORD2), (uint32_t)offsetof(XSPI_Type, FRAD7_WORD2), \
    }

#define XSPI_FRAD_WORD3_REG_OFFSET_ARRAY                                                            \
    {                                                                                               \
        (uint32_t) offsetof(XSPI_Type, FRAD0_WORD3), (uint32_t)offsetof(XSPI_Type, FRAD1_WORD3),    \
            (uint32_t)offsetof(XSPI_Type, FRAD2_WORD3), (uint32_t)offsetof(XSPI_Type, FRAD3_WORD3), \
            (uint32_t)offsetof(XSPI_Type, FRAD4_WORD3), (uint32_t)offsetof(XSPI_Type, FRAD5_WORD3), \
            (uint32_t)offsetof(XSPI_Type, FRAD6_WORD3), (uint32_t)offsetof(XSPI_Type, FRAD7_WORD3), \
    }

#define XSPI_FRAD_WORD4_REG_OFFSET_ARRAY                                                            \
    {                                                                                               \
        (uint32_t) offsetof(XSPI_Type, FRAD0_WORD4), (uint32_t)offsetof(XSPI_Type, FRAD1_WORD4),    \
            (uint32_t)offsetof(XSPI_Type, FRAD2_WORD4), (uint32_t)offsetof(XSPI_Type, FRAD3_WORD4), \
            (uint32_t)offsetof(XSPI_Type, FRAD4_WORD4), (uint32_t)offsetof(XSPI_Type, FRAD5_WORD4), \
            (uint32_t)offsetof(XSPI_Type, FRAD6_WORD4), (uint32_t)offsetof(XSPI_Type, FRAD7_WORD4), \
    }

#define XSPI_FRAD_WORD5_REG_OFFSET_ARRAY                                                            \
    {                                                                                               \
        (uint32_t) offsetof(XSPI_Type, FRAD0_WORD5), (uint32_t)offsetof(XSPI_Type, FRAD1_WORD5),    \
            (uint32_t)offsetof(XSPI_Type, FRAD2_WORD5), (uint32_t)offsetof(XSPI_Type, FRAD3_WORD5), \
            (uint32_t)offsetof(XSPI_Type, FRAD4_WORD5), (uint32_t)offsetof(XSPI_Type, FRAD5_WORD5), \
            (uint32_t)offsetof(XSPI_Type, FRAD6_WORD5), (uint32_t)offsetof(XSPI_Type, FRAD7_WORD5), \
    }

#define XSPI_TGSFAR_REG_OFFSET                                                              \
    {                                                                                       \
        offsetof(XSPI_Type, TGSFAR), offsetof(XSPI_Type, SUB_REG_MDAM_ARRAY[0].TGSFAR_SUB), \
    }

#define XSPI_TGSFARS_REG_OFFSET                                                               \
    {                                                                                         \
        offsetof(XSPI_Type, TGSFARS), offsetof(XSPI_Type, SUB_REG_MDAM_ARRAY[0].TGSFARS_SUB), \
    }

#define XSPI_TGIPCRS_REG_OFFSET                                                               \
    {                                                                                         \
        offsetof(XSPI_Type, TGIPCRS), offsetof(XSPI_Type, SUB_REG_MDAM_ARRAY[0].TGIPCRS_SUB), \
    }

#define XSPI_SFP_TG_IPCR_REG_OFFSET                                                                   \
    {                                                                                                 \
        offsetof(XSPI_Type, SFP_TG_IPCR), offsetof(XSPI_Type, SUB_REG_MDAM_ARRAY[0].SFP_TG_SUB_IPCR), \
    }

#define XSPI_SFP_TG_SFAR_REG_OFFSET                                                                   \
    {                                                                                                 \
        offsetof(XSPI_Type, SFP_TG_SFAR), offsetof(XSPI_Type, SUB_REG_MDAM_ARRAY[0].SFP_TG_SUB_SFAR), \
    }

#define XSPI_MCR_X16_MODE_MASK  (0x300000UL)
#define XSPI_MCR_X16_MODE_SHIFT (20UL)
#define XSPI_MCR_X16_MODE(x)    (((uint32_t)(x) << XSPI_MCR_X16_MODE_SHIFT) & XSPI_MCR_X16_MODE_MASK)
/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static uint8_t XSPI_GetPPWBFromPageSize(uint32_t pageSize);

