Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! brief Pointers to xspi bases for each instance. */
static XSPI_Type *const s_xspiBases[] = XSPI_BASE_PTRS;

/*! brief Pointers to xspi IRQ number for each instance. */
static const IRQn_Type s_xspiIrqs[] = XSPI_IRQS;

/*! brief Pointers to xspi amba base for each instance. */
static uint32_t s_xspiAmbaBase[] = XSPI_AMBA_BASES;

static xspi_transfer_t *s_xspiTransfer[ARRAY_SIZE(s_xspiBases)];

#if defined(FSL_DRIVER_TRANSFER_DOUBLE_WEAK_IRQ) && FSL_DRIVER_TRANSFER_DOUBLE_WEAK_IRQ
static xspi_handle_t *s_xspiHandle[ARRAY_SIZE(s_xspiBases)];
#endif

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/* Clock name array */
static const clock_ip_name_t s_xspiClock[] = XSPI_CLOCKS;

#ifdef CACHE64_CLOCKS
/* Array of CACHE64_CTRL clock name. */
static const clock_ip_name_t s_xspi_cache64Clocks[] = CACHE64_CLOCKS;
#endif
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/*! brief Pointers to XSPI resets for each instance. */
static const reset_ip_name_t s_xspiResets[] = XSPI_RSTS;

static uint32_t s_tgSfarsRegOffset[]     = XSPI_TGSFARS_REG_OFFSET;
static uint32_t s_tgIpcrsRegOffset[]     = XSPI_TGIPCRS_REG_OFFSET;
static uint32_t s_sfpTgIpcrRegOffset[]   = XSPI_SFP_TG_IPCR_REG_OFFSET;
static uint32_t s_sfpTgIpSfarRegOffset[] = XSPI_SFP_TG_SFAR_REG_OFFSET;
static uint32_t s_tgMdadRegOffset[]      = XSPI_TG_MDAD_REG_OFFSET_ARRAY;

volatile bool g_IpAccessIpcrFail = false;
volatile bool g_IpAccessSfarFail = false;

volatile uint32_t g_programFlashSize = 0UL;

/*******************************************************************************
 * Code
 ******************************************************************************/

static uint8_t XSPI_GetPPWBFromPageSize(uint32_t pageSize)
{
    uint8_t ppwbValue = 0U;

    g_programFlashSize = pageSize;
    switch (pageSize)
    {
        case 64UL:
        {
            ppwbValue = 6U;
            break;
        }
        case 128UL:
        {
            ppwbValue = 7U;
            break;
        }
        case 256UL:
        {
            ppwbValue = 8U;
            break;
        }
        case 512UL:
        {
            ppwbValue = 9U;
            break;
        }
        case 1024UL:
        {
            ppwbValue = 10U;
            break;
        }
        case 2048UL:
        {
            ppwbValue = 11U;
            break;
        }
        case 4096UL:
        {
            ppwbValue = 12U;
            break;
        }
        default:
        {
            /* Input pageSize not included. */
            assert(false);
            break;
        }
    }

    return ppwbValue;
}

static status_t XSPI_StartIpReadNonBlocking(XSPI_Type *base, xspi_handle_t *handle, uint32_t dataSize)
{
    uint32_t rxBufferWaterMark = 0UL;
    uint32_t transferSize = 0UL;
    status_t status = kStatus_Success;
    uint32_t instance = XSPI_GetInstance(base);
    
    XSPI_ClearRxBuffer(base);
    XSPI_ClearCmdExecutionArbitrationStatusFlags(base, (uint32_t)(kXSPI_FlagIpCmdFinished | kXSPI_FlagRxBufferWatermarkExceeded |
                                                  kXSPI_FlagRxBufferOverflow));
    if (dataSize >= XSPI_IP_RX_BUFFER_SIZE)
    {
        /* In case of data size is larger than RX buffer size, the big size request should be break into small
        size sub-request, and the transfer size of sub-request is equal to buffer size. */
        rxBufferWaterMark = XSPI_IP_RX_BUFFER_SIZE >> 1UL;
        transferSize = XSPI_IP_RX_BUFFER_SIZE;
    }
    else if (dataSize > (XSPI_IP_RX_BUFFER_SIZE >> 1UL))
    {
        /* In case of data size is larger than maximum watermark value, watermark set as maximum value, and
        transfer size is data size. */
        rxBufferWaterMark = XSPI_IP_RX_BUFFER_SIZE >> 1UL;
        transferSize = dataSize;
    }
    else if (dataSize % 4UL == 0UL)
    {
        /* In case of data size less than maximum watermark value and is aligned with 4 bytes, watermark set as 
        data size, transfer size also set as data size. */
        rxBufferWaterMark = dataSize;
        transferSize = dataSize;
    }
    else
    {
        rxBufferWaterMark = (dataSize / 4UL) << 2UL;
        if (rxBufferWaterMark == 0UL)
        {
            rxBufferWaterMark = 4UL;
        }
        transferSize = dataSize;
    }
    (void)XSPI_UpdateRxBufferWaterMark(base, rxBufferWaterMark);

    handle->state = kXSPI_StateStartIpAccess;
    status = XSPI_StartIpAccessNonBlocking(base, s_xspiTransfer[instance]->deviceAddress,
                                        s_xspiTransfer[instance]->seqIndex, transferSize, 
                                        s_xspiTransfer[instance]->targetGroup,
                                        s_xspiTransfer[instance]->lockArbitration);

    if (status != kStatus_Success)
    {
        return status;
    }
    if (handle->state != kXSPI_StateIpAccessGranted)
    {
        return kStatus_XSPI_IpAccessNotGranted;
    }
    handle->state = kXSPI_StateBusyRead;

    XSPI_EnableInterrupts(base, (uint64_t)(kXSPI_RxBufferDrainIntEnable | kXSPI_RxBufferOverflowIntEnable |
                            kXSPI_TimeoutErrIntEnable | kXSPI_IpCmdTrigFailErrorIntEnable));
    return status;
}

static status_t XSPI_StartIpWriteNonBlocking(XSPI_Type *base, xspi_handle_t *handle, uint32_t dataSize)
{
    status_t status = kStatus_Success;
    uint32_t transferSize = 0UL;
    uint32_t instance = XSPI_GetInstance(base);

    XSPI_ClearTxBuffer(base);

    if (dataSize >= XSPI_IP_TX_BUFFER_SIZE)
    {
        transferSize = XSPI_IP_TX_BUFFER_SIZE;
    }
    else
    {
        transferSize = dataSize;
    }

    handle->curTransferSize = transferSize;
    handle->state = kXSPI_StateStartIpAccess;
    status = XSPI_StartIpAccessNonBlocking(base, s_xspiTransfer[instance]->deviceAddress,
                                        s_xspiTransfer[instance]->seqIndex, transferSize,
                                        s_xspiTransfer[instance]->targetGroup,
                                        s_xspiTransfer[instance]->lockArbitration);
    if (status != kStatus_Success)
    {
        return status;
    }
    if (handle->state != kXSPI_StateIpAccessGranted)
    {
        return kStatus_XSPI_IpAccessNotGranted;
    }

    handle->state = kXSPI_StateBusyWrite;
    XSPI_EnableInterrupts(base, (uint64_t)(kXSPI_TxBufferFillIntEnable | kXSPI_TxBufferUnderrunIntEnable|
                                        kXSPI_TimeoutErrIntEnable | kXSPI_IpCmdTrigFailErrorIntEnable));
    
