Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
    return status;
}

/******************* Initialization And Deinitialization Functional Interfaces Start ***********************/
/*!
 * brief Get the instance number for XSPI.
 *
 * param base XSPI base pointer.
 */
uint32_t XSPI_GetInstance(XSPI_Type *base)
{
    uint32_t instance;

    /* Find the instance index from base address mappings. */
    for (instance = 0; instance < ARRAY_SIZE(s_xspiBases); instance++)
    {
        if (MSDK_REG_SECURE_ADDR(s_xspiBases[instance]) == MSDK_REG_SECURE_ADDR(base))
        {
            break;
        }
    }

    assert(instance < ARRAY_SIZE(s_xspiBases));

    return instance;
}

/*!
 * brief Check and clear IP command execution errors.
 *
 * param base XSPI base pointer.
 * param status interrupt status.
 */
status_t XSPI_CheckAndClearError(XSPI_Type *base, uint32_t status)
{
    status_t result = kStatus_Success;

    /* Check for error. */
    status &= (uint32_t)(kXSPI_ErrorNoFradMatch | kXSPI_ErrorFrad0Access | kXSPI_ErrorFrad1Access | \
                    kXSPI_ErrorFrad2Access | kXSPI_ErrorFrad3Access | kXSPI_ErrorFrad4Access | kXSPI_ErrorFrad5Access |
                    kXSPI_ErrorFrad6Access | kXSPI_ErrorFrad7Access | kXSPI_ErrorIpBusTransfer | kXSPI_ErrorTg0Ipcr |
                    kXSPI_ErrorTg0Sfar | kXSPI_ErrorTg1Ipcr | kXSPI_ErrorTg1Sfar | kXSPI_ErrorTimeout);
    if (0U != status)
    {
        /* Select the correct error code.. */
        if (0U != (status & (uint32_t)kXSPI_SequenceExecutionTimeoutFlag))
        {
            result = kStatus_XSPI_SequenceExecutionTimeout;
            /* Clear the flags. */
            base->ERRSTAT = (uint32_t)kXSPI_SequenceExecutionTimeoutFlag;
        }
        else if (0U != ((status & (uint32_t)kXSPI_FradMatchErrorFlag) | (status & (uint32_t)kXSPI_FradnAccErrorFlag)))
        {
            result = kStatus_XSPI_FradCheckError;
            /* Clear the flags. */
            if (0U != (status & (uint32_t)kXSPI_FradMatchErrorFlag))
            {
                base->ERRSTAT = (uint32_t)kXSPI_FradMatchErrorFlag;
            }
            else
            {
                base->ERRSTAT = (uint32_t)kXSPI_FradnAccErrorFlag;
            }
        }
        else if (0U != (status & (uint32_t)kXSPI_IpsErrorFlag))
        {
            result = kStatus_XSPI_IpsBusTransError;
            /* Clear the flags. */
            base->IPSERROR |= XSPI_IPSERROR_CLR_MASK;
        }
        else if (0U != ((status & (uint32_t)kXSPI_Tg0SfarErrorFlag) | (status & (uint32_t)kXSPI_Tg1SfarErrorFlag) |
                        (status & (uint32_t)kXSPI_TgnIpcrErrorFlag)))
        {
            result = kStatus_XSPI_TgQueueWritingError;
            /* Clear the flags. */
            if (0U != ((status & (uint32_t)kXSPI_Tg0SfarErrorFlag) | (status & (uint32_t)kXSPI_Tg1SfarErrorFlag)))
            {
                base->TGSFARS |= XSPI_TGSFARS_CLR_MASK;
            }
            else
            {
                base->TGIPCRS |= XSPI_TGIPCRS_CLR_MASK;
            }
        }
        else
        {
            assert(false);
        }

        /* Reset fifo. These flags clear automatically. */
        base->MCR |= XSPI_MCR_CLR_RXF_MASK;
        base->MCR |= XSPI_MCR_CLR_TXF_MASK;
    }

    return result;
}

/*!
 * brief Initializes the XSPI module and internal state.
 *
 * This function  configures the XSPI with the
 * input configure parameters. Users should call this function before any XSPI operations.
 *
 * param base XSPI peripheral base address.
 * param config XSPI configure structure.
 */

void XSPI_Init(XSPI_Type *base, const xspi_config_t *ptrConfig)
{
    uint32_t tmp32 = 0UL;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Enable the xspi clock */
    (void)CLOCK_EnableClock(s_xspiClock[XSPI_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
    /* Reset the XSPI module */
    RESET_ReleasePeripheralReset(s_xspiResets[XSPI_GetInstance(base)]);

    /* Reset SFM, AHB domain and TG queue. */
    XSPI_SoftwareReset(base);

    /* Disable module before initialization. */
    XSPI_EnableModule(base, false);

    /* Clear AHB buffer, TX buffer, RX buffer. */
    XSPI_ClearAhbBuffer(base);
    XSPI_ClearTxBuffer(base);
    XSPI_ClearRxBuffer(base);

    /* If any flags are asserted, clear firstly. */
    tmp32 = base->FR;
    if (tmp32 != 0UL)
    {
        base->FR = tmp32;
    }

    XSPI_EnableDozeMode(base, ptrConfig->enableDoze);

    base->MCR = ((base->MCR) & (~XSPI_MCR_END_CFG_MASK)) | XSPI_MCR_END_CFG(ptrConfig->byteOrder);

    if (ptrConfig->ptrAhbAccessConfig != NULL)
    {
        (void)XSPI_SetAhbAccessConfig(base, ptrConfig->ptrAhbAccessConfig);
    }

    if (ptrConfig->ptrIpAccessConfig != NULL)
    {
        (void)XSPI_SetIpAccessConfig(base, ptrConfig->ptrIpAccessConfig);
    }

    /* Enable XSPI module. */
    XSPI_EnableModule(base, true);
}

/*!
 * brief Gets default settings for XSPI.
 *
 * param base XSPI peripheral base address.
 * param config XSPI configuration structure.
 * param devconfig Flash configuration parameters.

 */
void XSPI_GetDefaultConfig(xspi_config_t *ptrConfig)
{
    assert(ptrConfig != NULL);

    ptrConfig->byteOrder  = kXSPI_64BitLE;
    ptrConfig->enableDoze = false;

    if (ptrConfig->ptrAhbAccessConfig != NULL)
    {
        /* If ptrAhbAccessConfig is not NULL, it means AHB access feature will be used. */
        ptrConfig->ptrAhbAccessConfig->ahbAlignment                = kXSPI_AhbAlignmentNoLimit;
        ptrConfig->ptrAhbAccessConfig->ahbErrorPayload.highPayload = 0UL;
        ptrConfig->ptrAhbAccessConfig->ahbErrorPayload.lowPayload  = 0UL;
        ptrConfig->ptrAhbAccessConfig->ahbSplitSize                = kXSPI_AhbSplitSizeDisabled;

        for (uint8_t i = 0U; i < XSPI_BUFCR_COUNT; i++)
        {
            ptrConfig->ptrAhbAccessConfig->buffer[i].masterId = i;
            if (i == 3U)
            {
                ptrConfig->ptrAhbAccessConfig->buffer[i].enaPri.enableAllMaster = true;
            }
            else
            {
                ptrConfig->ptrAhbAccessConfig->buffer[i].enaPri.enablePriority = false;
            }
            ptrConfig->ptrAhbAccessConfig->buffer[i].bufferSize = 0x80U;

