Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
            ptrConfig->ptrAhbAccessConfig->buffer[i].ptrSubBuffer0Config = NULL;
            ptrConfig->ptrAhbAccessConfig->buffer[i].ptrSubBuffer1Config = NULL;
            ptrConfig->ptrAhbAccessConfig->buffer[i].ptrSubBuffer2Config = NULL;
            ptrConfig->ptrAhbAccessConfig->buffer[i].ptrSubBuffer3Config = NULL;
        }
        ptrConfig->ptrAhbAccessConfig->ptrAhbWriteConfig         = NULL;
        ptrConfig->ptrAhbAccessConfig->enableAHBPrefetch         = true;
        ptrConfig->ptrAhbAccessConfig->enableAHBBufferWriteFlush = false;
        ptrConfig->ptrAhbAccessConfig->ARDSeqIndex               = 0U;
    }

    if (ptrConfig->ptrIpAccessConfig != NULL)
    {
        /* If ptrAhbAccessConfig is not NULL, it means AHB access feature will be used. */
        /* In default settings, FRAD check and MDAD check are both disabled. */
        ptrConfig->ptrIpAccessConfig->ptrSfpMdadConfig               = NULL;
        ptrConfig->ptrIpAccessConfig->ptrSfpFradConfig               = NULL;
        ptrConfig->ptrIpAccessConfig->sfpArbitrationLockTimeoutValue = 0xFFFFFUL;
        ptrConfig->ptrIpAccessConfig->ipAccessTimeoutValue           = 0xFFFFUL;
    }
}

/*!
 * brief Deinitialize the XSPI module.
 *
 * Clears the XSPI state and  XSPI module registers.
 * param base XSPI peripheral base address.
 */
void XSPI_Deinit(XSPI_Type *base)
{
    XSPI_EnableModule(base, false);
    /* Reset peripheral. */
    XSPI_SoftwareReset(base);
}

/*! brief Updates the LUT table.
 *
 * param base XSPI peripheral base address.
 * param index From which index start to update. It could be any index of the LUT table, which
 * also allows user to update command content inside a command. Each command consists of up to
 * 10 instructions and occupy 4*32-bit memory.
 * param cmd Command sequence array.
 * param count Number of instruction-operand pairs.
 */
void XSPI_UpdateLUT(XSPI_Type *base, uint8_t index, const uint32_t *cmd, uint8_t count)
{
    assert(index < 80U);

    uint32_t i = 0;
    volatile uint32_t *lutBase;

    /* Wait for bus to be idle before changing flash configuration. */
    while (!XSPI_GetBusIdleStatus(base))
    {
    }

    /* Unlock LUT for update. */
    base->LUTKEY = XSPI_LUT_KEY_VAL;
    base->LCKCR  = 0x02;

    lutBase = &base->LUT[index];
    for (i = 0; i < count; i++)
    {
        *lutBase++ = *cmd++;
    }

    /* Lock LUT. */
    base->LUTKEY = XSPI_LUT_KEY_VAL;
    base->LCKCR  = 0x01;
}

/******************* Initialization And Deinitialization Functional Interfaces End ***********************/

/***************************** XSPI Controller Low-Level Inferfaces Start ********************************/
/*!
 * brief Reset Serial flash memory domain and AHB domain at the same time.
 *
 * note Resetting only the Serial flash memory domain and AHB domain may cause undesirable side effects.
 *
 * param base XSPI peripheral base address.
 */
void XSPI_ResetSfmAndAhbDomain(XSPI_Type *base)
{
    /* XSPI module must be enabled, before assert reset to domains. */
    XSPI_EnableModule(base, true);

    base->MCR |= XSPI_MCR_SWRSTSD_MASK | XSPI_MCR_SWRSTHD_MASK;
    for (uint8_t i = 0U; i < 6U; i++)
    {
        __NOP();
    }
    /* Before de-assert the software reset, XSPI module should be disabled. */
    XSPI_EnableModule(base, false);
    base->MCR &= ~(XSPI_MCR_SWRSTSD_MASK | XSPI_MCR_SWRSTHD_MASK);
    for (uint8_t i = 0U; i < 6U; i++)
    {
        __NOP();
    }
    /* After de-assert the software resets, XSPI module should be enabled. */
    XSPI_EnableModule(base, true);
}

/***************************** XSPI Controller Low-Level Inferfaces End ********************************/

/***************************** External Device Control Low-Level Interfaces Start ********************************/
/*!
 * brief Set Hyper bus X16 mode.
 *
 * param base XSPI peripheral base address.
 * param x16Mode Specify X16 mode.
 */
void XSPI_SetHyperBusX16Mode(XSPI_Type *base, xspi_hyper_bus_x16_mode_t x16Mode)
{
    bool isEnabled = false;

    if (XSPI_CheckModuleEnabled(base))
    {
        isEnabled = true;
        XSPI_EnableModule(base, false);
    }

    base->MCR = ((base->MCR) & (~XSPI_MCR_X16_MODE_MASK)) | XSPI_MCR_X16_MODE(x16Mode);

    if (isEnabled)
    {
        XSPI_EnableModule(base, true);
    }
}

/*!
 * brief Update DLL configuration.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] ptrDllConfig Pointer to the DLL configuration.
 * param[in] enableDDR DDR mode is enabled or not.
 * param[in] enableX16Mode X16 mode is enabled or not.
 * param[in] xspiRootClk The frequency of xspi root clock, the unit is Hz.
 */
void XSPI_UpdateDllValue(XSPI_Type *base, xspi_dll_config_t *ptrDllConfig,
                        bool enableDDR, bool enableX16Mode, uint32_t xspiRootClk)
{
    (void)enableX16Mode;
    uint32_t offsetDelayElementCount = 0UL;
    uint8_t tapNum              = ptrDllConfig->dllCustomDelayTapNum;
    bool enableCourseDelayLine8 = ptrDllConfig->enableCdl8;

    if (ptrDllConfig->useRefValue == true)
    {
        if (enableDDR)
        {
            tapNum                 = FSL_FEATURE_XSPI_DLL_REF_VALUE_DDR_DELAY_TAP_NUM;
            enableCourseDelayLine8 = true;
        }
        else
        {
            tapNum                 = FSL_FEATURE_XSPI_DLL_REF_VALUE_SDR_DELAY_TAP_NUM;
            enableCourseDelayLine8 = false;
        }
    }

    base->MCR |= XSPI_MCR_MDIS_MASK;
    base->SMPR = (((base->SMPR) & (~XSPI_SMPR_DLLFSMPFA_MASK)) | XSPI_SMPR_DLLFSMPFA(tapNum));
    base->MCR &= ~XSPI_MCR_MDIS_MASK;

    if (ptrDllConfig->dllMode == kXSPI_BypassMode)
    {
        /* In case of DLL mode is selected as Bypass mode. */
        uint32_t delayElementCoarseAdjust = 0UL;
        uint32_t delayElementFineAdjust   = 0UL;

        offsetDelayElementCount  = (uint32_t)((ptrDllConfig->useRefValue) ?
                                       FSL_FEATURE_XSPI_DLL_REF_VALUE_BYPASS_OFFSET_DELAY_ELEMENT_COUNT :
                                       (ptrDllConfig->dllCustomPara.bypassModePara.offsetDelayElementCount));
        delayElementCoarseAdjust = (uint32_t)((ptrDllConfig->useRefValue) ?
                                       FSL_FEATURE_XSPI_DLL_REF_VALUE_BYPASS_DELAY_ELEMENT_COARSE :
                                       (ptrDllConfig->dllCustomPara.bypassModePara.delayElementCoarseValue));
        delayElementFineAdjust   = (uint32_t)((ptrDllConfig->useRefValue) ?
                                       FSL_FEATURE_XSPI_DLL_REF_VALUE_BYPASS_DELAY_ELEMENT_FINE :
                                       (ptrDllConfig->dllCustomPara.bypassModePara.delayElementFineValue));

        base->DLLCR[0] &=
            ~(XSPI_DLLCR_SLAVE_AUTO_UPDT_MASK | XSPI_DLLCR_SLV_DLY_FINE_MASK | XSPI_DLLCR_SLV_DLY_COARSE_MASK |
              XSPI_DLLCR_SLV_FINE_OFFSET_MASK | XSPI_DLLCR_DLL_CDL8_MASK);
        /* Enable subordinate delay chain as bypass mode. */
        base->DLLCR[0] |= XSPI_DLLCR_SLV_EN_MASK | XSPI_DLLCR_SLV_DLL_BYPASS_MASK;
        /* program DLL to desired delay. */
        base->DLLCR[0] |=
            XSPI_DLLCR_SLV_DLY_FINE(delayElementFineAdjust) | XSPI_DLLCR_SLV_DLY_COARSE(delayElementCoarseAdjust) |
            XSPI_DLLCR_SLV_FINE_OFFSET(offsetDelayElementCount) | XSPI_DLLCR_DLL_CDL8(enableCourseDelayLine8);
        /* Load above settings into delay chain. */
        base->DLLCR[0] |= XSPI_DLLCR_SLV_UPD_MASK;

        while ((base->DLLSR & XSPI_DLLSR_SLVA_LOCK_MASK) == 0UL)
        {
        }
        base->DLLCR[0] &= ~XSPI_DLLCR_SLV_UPD_MASK;
    }
    else
    {
        /* In case of DLL mode is selected as auto update mode. */
        bool enableHighFreq                   = false;
        uint32_t refCounterValue               = 0UL;
        uint32_t resolutionValue               = 0UL;
        uint32_t tDiv16OffsetDelayElementCount = 0UL;

        enableHighFreq =
            (ptrDllConfig->useRefValue) ?
                ((xspiRootClk >= FSL_FEATURE_XSPI_DLL_REF_VALUE_AUTOUPDATE_FREQ_THRESHOLD) ? true : false) :
                ((bool)(ptrDllConfig->dllCustomPara.autoUpdateModoPara.enableHighFreq));
        refCounterValue = (uint32_t)((ptrDllConfig->useRefValue) ?
                            FSL_FEATURE_XSPI_DLL_REF_VALUE_AUTOUPDATE_REF_COUNTER :
                            (ptrDllConfig->dllCustomPara.autoUpdateModoPara.referenceCounter));
        resolutionValue = (uint32_t)((ptrDllConfig->useRefValue) ?
                            FSL_FEATURE_XSPI_DLL_REF_VALUE_AUTOUPDATE_RES :
                            (ptrDllConfig->dllCustomPara.autoUpdateModoPara.resolution));
        tDiv16OffsetDelayElementCount =
            (uint32_t)((ptrDllConfig->useRefValue) ?
                FSL_FEATURE_XSPI_DLL_REF_VALUE_AUTOUPDATE_T_DIV16_OFFSET_DELAY_ELEMENT_COUNT :
                (ptrDllConfig->dllCustomPara.autoUpdateModoPara.tDiv16OffsetDelayElementCount));
        offsetDelayElementCount = (uint32_t)((ptrDllConfig->useRefValue) ?
                                      FSL_FEATURE_XSPI_DLL_REF_VALUE_AUTOUPDATE_OFFSET_DELAY_ELEMENT_COUNT :
                                      (ptrDllConfig->dllCustomPara.autoUpdateModoPara.offsetDelayElementCount));

