Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
        base->DLLCR[0] &= ~(XSPI_DLLCR_SLV_DLL_BYPASS_MASK | XSPI_DLLCR_DLL_CDL8_MASK | XSPI_DLLCR_SLV_DLY_OFFSET_MASK |
                            XSPI_DLLCR_SLV_FINE_OFFSET_MASK | XSPI_DLLCR_DLLRES_MASK | XSPI_DLLCR_DLL_REFCNTR_MASK |
                            XSPI_DLLCR_FREQEN_MASK);
        /* Enable subordinate as auto update mode. */
        base->DLLCR[0] |= XSPI_DLLCR_SLV_EN_MASK | XSPI_DLLCR_SLAVE_AUTO_UPDT_MASK;
        /* program DLL to desired delay. */
        base->DLLCR[0] |= XSPI_DLLCR_DLLRES(resolutionValue) | XSPI_DLLCR_DLL_REFCNTR(refCounterValue) |
                          XSPI_DLLCR_SLV_FINE_OFFSET(offsetDelayElementCount) |
                          XSPI_DLLCR_SLV_DLY_OFFSET(tDiv16OffsetDelayElementCount) | XSPI_DLLCR_FREQEN(enableHighFreq);
        /* Load above settings into delay chain. */
        base->DLLCR[0] |= XSPI_DLLCR_SLV_UPD_MASK;
        base->DLLCR[0] |= XSPI_DLLCR_DLLEN_MASK;
        base->DLLCR[0] &= ~XSPI_DLLCR_SLV_UPD_MASK;
        while ((base->DLLSR & XSPI_DLLSR_SLVA_LOCK_MASK) == 0UL)
        {
        }
    }
}

/*!
 * brief Set Data learning configurations.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] ptrDataLearningConfig Pointer to data learning configuration.
 * 
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail to set data learning configuration due to AHB read access asserted.
 * retval kStatus_XSPI_IPAccessAsserted Fail to set data learning configuration due to a IP access already asserted.
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail to set data learning configuration due to AHB write access asserted.
 * retval kStatus_Success  Successfully to set Data learning configurations.
 */
status_t XSPI_SetDataLearningConfig(XSPI_Type *base, xspi_data_learning_config_t *ptrDataLearningConfig)
{
    assert(ptrDataLearningConfig != NULL);

    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckIPAccessAsserted(base))
    {
        return kStatus_XSPI_IPAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    base->DLCR = ((base->DLCR) & ~(XSPI_DLCR_DLP_SEL_FA_MASK | XSPI_DLCR_DL_NONDLP_FLSH_MASK)) |
                 (XSPI_DLCR_DLP_SEL_FA(ptrDataLearningConfig->padSelected) |
                  XSPI_DLCR_DL_NONDLP_FLSH(ptrDataLearningConfig->deviceSupported));

    base->DLPR = ptrDataLearningConfig->pattern;

    return kStatus_Success;
}

/*!
 * brief Update address mode to access external device.
 * 
 * param base XSPI peripheral base address.
 * param addrMode Specify the address mode to update.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail to update address mode due to AHB read access asserted.
 * retval kStatus_XSPI_IPAccessAsserted Fail to update address mode due to a IP access already asserted.
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail to update address mode due to AHB write access asserted.
 * retval kStatus_Success  Successfully to update address mode.
 */
status_t XSPI_UpdateDeviceAddrMode(XSPI_Type *base, xspi_device_addr_mode_t addrMode)
{
    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckIPAccessAsserted(base))
    {
        return kStatus_XSPI_IPAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }
    
    if (addrMode != kXSPI_Device4ByteAddressable)
    {
        base->SFACR =
            (base->SFACR & ~(XSPI_SFACR_WA_MASK | XSPI_SFACR_WA_4B_EN_MASK)) | XSPI_SFACR_WA(addrMode);
    }
    else
    {
        base->SFACR &= ~XSPI_SFACR_WA_MASK;
        base->SFACR |= XSPI_SFACR_WA_4B_EN_MASK;
    }
    
    return kStatus_Success;
}

/***************************** External Device Control Low-Level Interfaces End ********************************/

/***************************** External Device Control Functional Interfaces Start ********************************/
/*!
 * brief Set device configuration.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] devConfig Pointer to device configuration.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail to set device configuration due to AHB read access asserted.
 * retval kStatus_XSPI_IPAccessAsserted Fail to set device configuration due to a IP access already asserted.
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail to set device configuration due to AHB write access asserted.
 * retval kStatus_Success  Successfully to set device configurations.
 */
status_t XSPI_SetDeviceConfig(XSPI_Type *base, xspi_device_config_t *devConfig)
{
    assert(devConfig != NULL);

    bool enableDDR     = false;
    bool enableX16Mode = false;
    uint32_t instance  = XSPI_GetInstance(base);

    if (XSPI_CheckIPAccessAsserted(base))
    {
        return kStatus_XSPI_IPAccessAsserted;
    }

    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    /* Set sample clock config. */
    bool isEnabled = false;

    if (XSPI_CheckModuleEnabled(base))
    {
        isEnabled = true;
        XSPI_EnableModule(base, false);
    }

    if (devConfig->enableCknPad)
    {
        base->MCR |= XSPI_MCR_CKN_FA_EN_MASK;
    }
    else
    {
        base->MCR &= ~XSPI_MCR_CKN_FA_EN_MASK;
    }

    uint8_t tmp8 = 0U;
    if (devConfig->deviceInterface == kXSPI_StrandardExtendedSPI)
    {
        tmp8 = XSPI_GetPPWBFromPageSize(devConfig->interfaceSettings.strandardExtendedSPISettings.pageSize);
        base->MCR &= ~XSPI_MCR_DQS_OUT_EN_MASK;
        base->SFACR = (base->SFACR & ~XSPI_SFACR_PPWB_MASK) | XSPI_SFACR_PPWB(tmp8);
    }
    else
    {
        tmp8 = XSPI_GetPPWBFromPageSize(devConfig->interfaceSettings.hyperBusSettings.pageSize);
        base->SFACR = (base->SFACR & ~XSPI_SFACR_PPWB_MASK) | XSPI_SFACR_PPWB(tmp8);
        XSPI_SetHyperBusX16Mode(base, devConfig->interfaceSettings.hyperBusSettings.x16Mode);
        if (devConfig->interfaceSettings.hyperBusSettings.x16Mode != kXSPI_x16ModeDisable)
        {
            enableX16Mode = true;
        }
        XSPI_EnableVariableLatency(base, devConfig->interfaceSettings.hyperBusSettings.enableVariableLatency);
        base->MCR |= XSPI_MCR_DQS_OUT_EN_MASK;
        base->SFACR = (base->SFACR & ~XSPI_SFACR_FORCE_A10_MASK) |
                      XSPI_SFACR_FORCE_A10(devConfig->interfaceSettings.hyperBusSettings.forceBit10To1);
    }

    base->FLSHCR = ((base->FLSHCR) & ~(XSPI_FLSHCR_TCSS_MASK | XSPI_FLSHCR_TCSH_MASK)) |
                   (XSPI_FLSHCR_TCSS(devConfig->CSSetupTime) | XSPI_FLSHCR_TCSH(devConfig->CSHoldTime));

    if (devConfig->addrMode != kXSPI_Device4ByteAddressable)
    {
        base->SFACR =
            (base->SFACR & ~(XSPI_SFACR_WA_MASK | XSPI_SFACR_WA_4B_EN_MASK)) | XSPI_SFACR_WA(devConfig->addrMode);
    }
    else
    {
        base->SFACR |= XSPI_SFACR_WA_4B_EN_MASK;
    }

    base->SFACR =
        (base->SFACR & ~(XSPI_SFACR_CAS_INTRLVD_MASK | XSPI_SFACR_CAS_MASK)) |
        (XSPI_SFACR_CAS_INTRLVD(devConfig->enableCASInterleaving) | XSPI_SFACR_CAS(devConfig->columnAddrWidth));

