Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
    if (devConfig->ptrDeviceRegInfo != NULL)
    {
        (void)XSPI_SetSFMStatusRegInfo(base, devConfig->ptrDeviceRegInfo);
    }

    if (devConfig->ptrDeviceDdrConfig != NULL)
    {
        enableDDR = devConfig->ptrDeviceDdrConfig->enableDdr;
    }

    if (enableDDR)
    {
        base->FLSHCR = ((base->FLSHCR) & ~XSPI_FLSHCR_TDH_MASK) |
                       XSPI_FLSHCR_TDH(devConfig->ptrDeviceDdrConfig->ddrDataAlignedClk);
        base->SFACR = ((base->SFACR) & ~XSPI_SFACR_BYTE_SWAP_MASK) |
                      XSPI_SFACR_BYTE_SWAP(devConfig->ptrDeviceDdrConfig->enableByteSwapInOctalMode);
        base->MCR |= XSPI_MCR_DDR_EN_MASK;
    }
    else
    {
        base->MCR &= ~XSPI_MCR_DDR_EN_MASK;
    }

    for (uint8_t i = 0U; i < XSPI_SFAD_COUNT2; i++)
    {
        base->SFAD[0][i] = s_xspiAmbaBase[instance] + XSPI_SFAD_TPAD(devConfig->deviceSize[i]);
    }

    uint32_t tmp32 = (base->MCR) & ~(XSPI_MCR_DQS_FA_SEL_MASK | XSPI_MCR_DQS_EN_MASK | XSPI_MCR_DQS_LAT_EN_MASK);

    if ((devConfig->sampleClkConfig.sampleClkSource == kXSPI_SampleClkFromDqsPadLoopback) ||
        (devConfig->sampleClkConfig.sampleClkSource == kXSPI_SampleClkFromExternalDQS))
    {
        tmp32 |= XSPI_MCR_DQS_EN_MASK;
    }
    tmp32 |= XSPI_MCR_DQS_LAT_EN(devConfig->sampleClkConfig.enableDQSLatency) |
             XSPI_MCR_DQS_FA_SEL((uint32_t)(devConfig->sampleClkConfig.sampleClkSource) & 0x3UL);
    base->MCR = tmp32;

    base->SMPR &= ~(XSPI_SMPR_FSPHS_MASK | XSPI_SMPR_FSDLY_MASK);

    if (devConfig->sampleClkConfig.sampleClkSource == kXSPI_SampleClkFromInvertedFullySpeedDummyPadLoopback)
    {
        base->SMPR |= XSPI_SMPR_FSPHS_MASK;
    }

    if (devConfig->sampleClkConfig.sampleClkSource == kXSPI_SampleClkFromHalfSpeedDummyPadLoopback)
    {
        base->SMPR |= XSPI_SMPR_FSDLY_MASK;
    }

    XSPI_UpdateDllValue(base, &(devConfig->sampleClkConfig.dllConfig), enableDDR, enableX16Mode,
                        devConfig->xspiRootClk);

    if (isEnabled)
    {
        XSPI_EnableModule(base, true);
    }

    return kStatus_Success;
}
/***************************** External Device Control Functional Interfaces End ********************************/

/***************************** IPS Access Control Low-Level Interfaces Start ********************************/
/*!
 * brief Update watermark for RX buffer.
 *
 * code
 * Set watermark as 4 bytes:
 * XSPI_UpdateRxBufferWaterMark(XSPI0, 4UL);
 * Set watermark as 8 bytes:
 * XSPI_UpdateRxBufferWaterMark(XSPI0, 8UL);
 * endcode
 *
 *
 * param[in] base XSPI peripheral base address.
 * param[in] waterMark Specify the number of bytes in the RX buffer which causes XSPI to assert the watermark exceeded
 * flag, should be in multiple of 4 bytes.
 *
 * retval kStatus_XSPI_IPAccessAsserted Fail to update watermark for Rx buffer, due to IP access is asserted.
 * retval kStatus_XSPI_WaterMarkIllegal Fail to update watermark for Tx buffer, due to input watermark is not the
 * multiple of 4 bytes.
 * retval kStatus_Success Successful to update watermark.
 */
status_t XSPI_UpdateRxBufferWaterMark(XSPI_Type *base, uint32_t waterMark)
{
    assert(waterMark != 0UL);
    assert(waterMark <= 256UL);

    if (XSPI_CheckIPAccessAsserted(base))
    {
        return kStatus_XSPI_IPAccessAsserted;
    }

    if ((waterMark % 4UL) != 0UL)
    {
        return kStatus_XSPI_WaterMarkIllegal;
    }

    base->RBCT = XSPI_RBCT_WMRK((waterMark / 4UL) - 1UL);

    return kStatus_Success;
}

/*!
 * brief Update watermark for TX buffer.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] waterMark The watermark to set, the unit is byte, should be the multiple of 4 byte.
 *
 * retval  kStatus_XSPI_IPAccessAsserted Fail to update watermark for Tx buffer, due to IP access is asserted.
 * retval kStatus_XSPI_WaterMarkIllegal Fail to update watermark for Tx buffer, due to input watermark is not the
 * multiple of 4 bytes.
 * retval kStatus_Success Successful to update watermark.
 */
status_t XSPI_UpdateTxBufferWaterMark(XSPI_Type *base, uint32_t waterMark)
{
    assert(waterMark != 0UL);
    if (XSPI_CheckIPAccessAsserted(base))
    {
        return kStatus_XSPI_IPAccessAsserted;
    }

    if ((waterMark % 4UL) != 0UL)
    {
        return kStatus_XSPI_WaterMarkIllegal;
    }

    base->TBCT = XSPI_TBCT_WMRK((waterMark / 4UL) - 1UL);

    return kStatus_Success;
}

/*!
 * brief Set exclusive access lock mode for the specific frad..
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] ealMode Specify the exclusive access lock mode.
 * param[in] fradId Specify the frad.
 */
void XSPI_SetSFPFradEALMode(XSPI_Type *base, xspi_exclusive_access_lock_mode_t ealMode, uint8_t fradId)
{
    uint32_t fradWord3RegOffset[] = XSPI_FRAD_WORD3_REG_OFFSET_ARRAY;

    uint32_t fradWord3RegAddr = (uint32_t)base + fradWord3RegOffset[fradId];

    xspi_exclusive_access_lock_mode_t curEalMode =
        (xspi_exclusive_access_lock_mode_t)(uint32_t)(((*(uint32_t *)fradWord3RegAddr) & XSPI_FRAD0_WORD3_EAL_MASK) >>
                                                      XSPI_FRAD0_WORD3_EAL_SHIFT);

    if (curEalMode != ealMode)
    {
        if (curEalMode == kXSPI_ExclusiveAccessLockEnabled)
        {
            *(uint32_t *)fradWord3RegAddr = (*(uint32_t *)fradWord3RegAddr & ~XSPI_FRAD0_WORD3_EAL_MASK) |
                                            XSPI_FRAD0_WORD3_EAL(kXSPI_ExclusiveAccessLockExceptMasterId);

            if (ealMode == kXSPI_ExclusiveAccessLockDisabled)
            {
                *(uint32_t *)fradWord3RegAddr = (*(uint32_t *)fradWord3RegAddr & ~XSPI_FRAD0_WORD3_EAL_MASK);
            }
        }
        else
        {
            *(uint32_t *)fradWord3RegAddr =
                (*(uint32_t *)fradWord3RegAddr & ~XSPI_FRAD0_WORD3_EAL_MASK) | XSPI_FRAD0_WORD3_EAL(ealMode);
        }
    }
}

/*!
 * brief Update SFP configurations, including MDAD configurations and FRAD configurations.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] ptrMdadConfig Pointer to the SFP MDAD configuration.
 * param[in] ptrFradConfig Pointer to the SFP FRAD configuration.
 */
void XSPI_UpdateSFPConfig(XSPI_Type *base,
                          xspi_sfp_mdad_config_t *ptrSfpMdadConfig,
                          xspi_sfp_frad_config_t *ptrSfpFradConfig)
{
    bool enableSFP  = false;
    bool enableMdad = false;
    bool enableFrad = false;
    uint8_t i       = 0U;

    enableMdad = (ptrSfpMdadConfig != NULL) ? true : false;
    enableFrad = (ptrSfpFradConfig != NULL) ? true : false;
    enableSFP  = (bool)(enableFrad | enableFrad);

    if (enableSFP)
    {
        if (enableMdad)
        {
            base->MGC |= (XSPI_MGC_GVLDMDAD_MASK | XSPI_MGC_GVLD_MASK);
            uint32_t tgMdadRegAddr     = 0UL;

            for (i = 0U; i < XSPI_TARGET_GROUP_COUNT; i++)
            {
                tgMdadRegAddr = (uint32_t)base + s_tgMdadRegOffset[i];

