Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
                *(uint32_t *)tgMdadRegAddr = XSPI_TG0MDAD_MIDMATCH(ptrSfpMdadConfig->tgMdad[i].masterIdReference) |
                                             XSPI_TG0MDAD_MASKTYPE(ptrSfpMdadConfig->tgMdad[i].maskType) |
                                             XSPI_TG0MDAD_MASK(ptrSfpMdadConfig->tgMdad[i].mask) |
                                             XSPI_TG0MDAD_VLD(ptrSfpMdadConfig->tgMdad[i].assignIsValid) |
                                             XSPI_TG0MDAD_SA(ptrSfpMdadConfig->tgMdad[i].secureAttribute);

                if (ptrSfpMdadConfig->tgMdad[i].enableDescriptorLock)
                {
                    *(uint32_t *)tgMdadRegAddr |= XSPI_TG0MDAD_LCK_MASK;
                }
            }
        }

        if (enableFrad)
        {
            base->MGC |= (XSPI_MGC_GVLDFRAD_MASK | XSPI_MGC_GVLD_MASK);
            uint32_t fradWord0RegOffset[] = XSPI_FRAD_WORD0_REG_OFFSET_ARRAY;
            uint32_t fradWord1RegOffset[] = XSPI_FRAD_WORD1_REG_OFFSET_ARRAY;
            uint32_t fradWord2RegOffset[] = XSPI_FRAD_WORD2_REG_OFFSET_ARRAY;
            uint32_t fradWord3RegOffset[] = XSPI_FRAD_WORD3_REG_OFFSET_ARRAY;

            uint32_t fradWord0RegAddr = 0UL;
            uint32_t fradWord1RegAddr = 0UL;
            uint32_t fradWord2RegAddr = 0UL;
            uint32_t fradWord3RegAddr = 0UL;

            for (i = 0U; i < XSPI_SFP_FRAD_COUNT; i++)
            {
                fradWord0RegAddr = (uint32_t)base + fradWord0RegOffset[i];
                fradWord1RegAddr = (uint32_t)base + fradWord1RegOffset[i];
                fradWord2RegAddr = (uint32_t)base + fradWord2RegOffset[i];
                fradWord3RegAddr = (uint32_t)base + fradWord3RegOffset[i];

                /* Set the most-significant 16 bits of the starting address(64-KB alignment). */
                *(uint32_t *)fradWord0RegAddr = ptrSfpFradConfig->fradConfig[i].startAddress & 0xFFFF0000UL;
                /* Set the most-significant 16 bits of the ending address(64-KB alignment). */
                *(uint32_t *)fradWord1RegAddr = ptrSfpFradConfig->fradConfig[i].endAddress & 0xFFFF0000UL;

                XSPI_SetSFPFradEALMode(base, ptrSfpFradConfig->fradConfig[i].exclusiveAccessLock, i);
                if (ptrSfpFradConfig->fradConfig[i].exclusiveAccessLock == kXSPI_ExclusiveAccessLockDisabled)
                {
                    *(uint32_t *)fradWord2RegAddr =
                        (*(uint32_t *)fradWord3RegAddr &
                         (~(XSPI_FRAD0_WORD2_MD0ACP_MASK | XSPI_FRAD0_WORD2_MD1ACP_MASK))) |
                        (XSPI_FRAD0_WORD2_MD0ACP(ptrSfpFradConfig->fradConfig[i].tg0MasterAccess) |
                         XSPI_FRAD0_WORD2_MD1ACP(ptrSfpFradConfig->fradConfig[i].tg1MasterAccess));
                }
                *(uint32_t *)fradWord3RegAddr =
                    ((*(uint32_t *)fradWord3RegAddr) & (~(XSPI_FRAD0_WORD3_LOCK_MASK | XSPI_FRAD0_WORD3_VLD_MASK))) |
                    (XSPI_FRAD0_WORD3_VLD(ptrSfpFradConfig->fradConfig[i].assignIsValid) |
                     XSPI_FRAD0_WORD3_LOCK(ptrSfpFradConfig->fradConfig[i].descriptorLock));
            }
        }
    }
    else
    {
        base->MGC &= ~(XSPI_MGC_GVLDFRAD_MASK | XSPI_MGC_GVLDMDAD_MASK | XSPI_MGC_GVLD_MASK);
    }
}

/*!
 * brief Get FARD latest transaction information.
 * 
 * param[in] base XSPI peripheral base address.
 * param[out] ptrInfo Pointer to the variable in type of ref xspi_frad_transaction_info_t to store information.
 * param[in] fradId Specify the frad Id.
 */
void XSPI_GetFradLastTransactionsInfo(XSPI_Type *base, xspi_frad_transaction_info_t *ptrInfo, uint8_t fradId)
{
    uint32_t fradWord4RegOffset[] = XSPI_FRAD_WORD4_REG_OFFSET_ARRAY;
    uint32_t fradWord5RegOffset[] = XSPI_FRAD_WORD5_REG_OFFSET_ARRAY;

    uint32_t fradWord4RegAddr = (uint32_t)base + fradWord4RegOffset[fradId];
    uint32_t fradWord5RegAddr = (uint32_t)base + fradWord5RegOffset[fradId];

    ptrInfo->startAddr = (*(uint32_t *)fradWord4RegAddr);
    ptrInfo->masterId =
        (uint8_t)(((*(uint32_t *)fradWord5RegAddr) & XSPI_FRAD0_WORD5_CMP_MDID_MASK) >> XSPI_FRAD0_WORD5_CMP_MDID_SHIFT);
    ptrInfo->isSecureAccess    = (bool)(((*(uint32_t *)fradWord5RegAddr) & XSPI_FRAD0_WORD5_CMP_SA_MASK) != 0UL);
    ptrInfo->isPrivilegeAccess = (bool)(((*(uint32_t *)fradWord5RegAddr) & XSPI_FRAD0_WORD5_CMP_PA_MASK) != 0UL);
    ptrInfo->isCompError       = (bool)(((*(uint32_t *)fradWord5RegAddr) & XSPI_FRAD0_WORD5_CMP_ERR_MASK) != 0UL);
    ptrInfo->isCompValid       = (bool)(((*(uint32_t *)fradWord5RegAddr) & XSPI_FRAD0_WORD5_CMPVALID_MASK) != 0UL);
}

/*!
 * brief Update SFP arbitration lock timeout counter.
 *
 * note The SFP arbitration lock time out counter starts when Page program wait flag asserted.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] countValue The count value, specify the time in IPS clock cycles.
 *
 * retval kStatus_XSPI_RegWriteLocked Write operation to related register is locked.
 * retval kStatus_Success Success to update timeout counter.
 */
status_t XSPI_UpdateSFPArbitrationLockTimeoutCounter(XSPI_Type *base, uint32_t countValue)
{
    if (XSPI_CheckGlobalConfigLocked(base))
    {
        return kStatus_XSPI_RegWriteLocked;
    }

    base->SFP_ARB_TIMEOUT = countValue;

    return kStatus_Success;
}

/*!
 * brief Update the count of SFP access timeout counter.
 *
 * note The counter starts when any IP access pass SFP check(if enabled), and request is granted by XSPI arbiter and
 * XSPI is IDLE.
 *
 * note The counter does not start in case of IP access was granted by XSPI is not IDLE.
 *
 * param base XSPI peripheral base address.
 * param countValue The count value, specify the time in IPS clock cycles.
 *
 * retval kStatus_XSPI_RegWriteLocked Write operation to related register is locked.
 * retval kStatus_Success Success to update timeout counter.
 */
status_t XSPI_UpdateIPAccessTimeoutCounter(XSPI_Type *base, uint32_t countValue)
{
    if (XSPI_CheckGlobalConfigLocked(base))
    {
        return kStatus_XSPI_RegWriteLocked;
    }

    base->MTO = countValue;

    return kStatus_Success;
}

/*!
 * brief Get MDAD check error reason for specific target group.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] tgId Specify the target group.
 *
 * return The details of MDAD error reason, in type of ref xspi_mdad_error_reason_t.
 */
xspi_mdad_error_reason_t XSPI_GetMdadErrorReason(XSPI_Type *base, xspi_target_group_t tgId)
{
    uint8_t tmp8 = 0U;

    if (tgId == kXSPI_TargetGroup0)
    {
        tmp8 = (uint8_t)((base->TGIPCRS & XSPI_TGIPCRS_ERR_MASK) >> XSPI_TGIPCRS_ERR_SHIFT);
    }
    else
    {
        tmp8 = (uint8_t)((base->SUB_REG_MDAM_ARRAY[0].TGIPCRS_SUB & XSPI_TGIPCRS_SUB_ERR_MASK) >>
                         XSPI_TGIPCRS_SUB_ERR_SHIFT);
    }

    return (xspi_mdad_error_reason_t)tmp8;
}

/*!
 * brief Clear address write status for specific target group.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] tgId Specify the target group to clear address write status.
 */
void XSPI_ClearTgAddrWriteStatus(XSPI_Type *base, xspi_target_group_t tgId)
{
    uint32_t tgSfarsRegAddr = (uint32_t)base + (uint32_t)s_tgSfarsRegOffset[(uint8_t)(tgId)];

    *((uint32_t *)tgSfarsRegAddr) |= XSPI_TGSFARS_CLR_MASK;
}

/*!
 * brief Get address write status for specific target group.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] tgId Specify the target group.
 * param[out] ptrStatus Pointer to the variable in type of ref xspi_tg_add_write_status_t
                        to store address write status.
 */
void XSPI_GetTgAddrWriteStatus(XSPI_Type *base, xspi_target_group_t tgId, xspi_tg_add_write_status_t *ptrStatus)
{
    uint32_t tgSfarsRegAddr = (uint32_t)base + (uint32_t)s_tgSfarsRegOffset[(uint8_t)(tgId)];
    uint32_t tmp32          = (*(uint32_t *)tgSfarsRegAddr);

