Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
    ptrStatus->managerId       = (uint8_t)(tmp32 & XSPI_TGSFARS_TG_MID_MASK);
    ptrStatus->secureWrite     = (bool)((tmp32 & XSPI_TGSFARS_SA_MASK) != 0UL);
    ptrStatus->privilegedWrite = (bool)((tmp32 & XSPI_TGSFARS_PA_MASK) != 0UL);
}

/*!
 * brief Unlock Ip access arbitration.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] tgId Specify the target group.
 */
void XSPI_UnlockIpAccessArbitration(XSPI_Type *base, xspi_target_group_t tgId)
{
    uint32_t tgIpcrRegOffset[] = XSPI_TGIPCRS_REG_OFFSET;
    uint32_t tgIpcrRegAddr     = (uint32_t)base + tgIpcrRegOffset[(uint8_t)tgId];

    *(uint32_t *)tgIpcrRegAddr |= XSPI_SFP_TG_IPCR_ARB_UNLOCK_MASK;
}

/*!
 * brief Start IP access(including read and write).
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] addr Address of external device to read/write.
 * param[in] seqIndex Sequence Id of the pre-programmed LUT.
 * param[in] byteSize Size of data to read/write, the unit of byte.
 * param[in] tgId Specify the target group used to write/read.
 * param[in] lockArbitration Lock arbitration or not.
 *
 * retval kStatus_XSPI_IpAccessAddrSettingInvalid Wrong Address input.
 * retval kStatus_XSPI_IpAccessIPCRInvalid Wrong seqindex or bytesize input.
 * retval kStatus_Success Success to start Ip access.
 */
status_t XSPI_StartIpAccess(
    XSPI_Type *base, uint32_t addr, uint8_t seqIndex, size_t byteSize, xspi_target_group_t tgId, bool lockArbitration)
{
    uint32_t tgSfarsRegAddr     = (uint32_t)base + (uint32_t)s_tgSfarsRegOffset[(uint8_t)tgId];
    uint32_t tgIpcrsRegAddr     = (uint32_t)base + (uint32_t)s_tgIpcrsRegOffset[(uint8_t)tgId];
    uint32_t sfpTgIpcrRegAddr   = (uint32_t)base + (uint32_t)s_sfpTgIpcrRegOffset[(uint8_t)tgId];
    uint32_t sfpTgIpSfarRegAddr = (uint32_t)base + (uint32_t)s_sfpTgIpSfarRegOffset[(uint8_t)tgId];
    uint32_t tgMdadRegAddr      = (uint32_t)base + (uint32_t)s_tgMdadRegOffset[(uint8_t)tgId];

    bool mdadEnabled = false;
    bool mdadValid   = false;
    uint32_t tmp32   = 0UL;

    XSPI_ClearErrorStatusFlags(base, kXSPI_ArbWinEventFlag);
    mdadEnabled = (bool)((base->MGC & XSPI_MGC_GVLDMDAD_MASK) != 0UL);
    mdadValid   = (((*(uint32_t *)tgMdadRegAddr) & XSPI_TG0MDAD_VLD_MASK) != 0UL);
    /* Check the selected target group queue is empty. */
    while (((*(volatile uint32_t *)tgSfarsRegAddr) & XSPI_TGSFARS_VLD_MASK) != 0UL)
    {
    }

    /* Set target address. */
    (*(uint32_t *)sfpTgIpSfarRegAddr) = addr;

    if (mdadEnabled && mdadValid)
    {
        do
        {
            tmp32 = (*(volatile uint32_t *)tgSfarsRegAddr & (XSPI_TGSFARS_VLD_MASK | XSPI_TGSFARS_ERR_MASK));
            if (tmp32 == XSPI_TGSFARS_ERR_MASK)
            {
                /* The manager ID or write attributes to set SFAR register is not valid. */
                return kStatus_XSPI_IpAccessAddrSettingInvalid;
            }
        } while (tmp32 != XSPI_TGSFARS_VLD_MASK);
    }

    /* Set transfer size and sequence ID. */
    (*(uint32_t *)sfpTgIpcrRegAddr) = XSPI_SFP_TG_IPCR_IDATSZ(byteSize) | XSPI_SFP_TG_IPCR_ARB_LOCK(lockArbitration) |
                                      XSPI_SFP_TG_IPCR_SEQID(seqIndex);
    if (mdadEnabled && mdadValid)
    {
        do
        {
            tmp32 = (*(volatile uint32_t *)tgIpcrsRegAddr & (XSPI_TGIPCRS_ERR_MASK | XSPI_TGIPCRS_VLD_MASK));
            if ((tmp32 & XSPI_TGIPCRS_ERR_MASK) != 0UL)
            {
                return kStatus_XSPI_IpAccessIPCRInvalid;
            }
        } while ((tmp32 & XSPI_TGIPCRS_VLD_MASK) == 0UL);
    }

    /* Blocking until the IP request is granted. */
    while (XSPI_CheckIpRequestGranted(base) == false)
    {
    }
    XSPI_ClearErrorStatusFlags(base, kXSPI_ArbWinEventFlag);

    return kStatus_Success;
}

/*!
 * brief Start IP access in non-blocking way.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] addr Address of external device to read/write.
 * param[in] seqIndex Sequence Id of the pre-programmed LUT.
 * param[in] byteSize Size of data to transfer, the unit of byte.
 * param[in] tgId Specify the target group to use.
 * param[in] lockArbitration Lock arbitration or not.
 * 
 * retval kStatus_Success Success to start Ip access.
 * retval kStatus_XSPI_IpAccessIPCRInvalid Invalid to set IPCR register.
 * retval kStatus_XSPI_IpAccessAddrSettingInvalid Invalid to set SFAR register.
 */
status_t XSPI_StartIpAccessNonBlocking(XSPI_Type *base, uint32_t addr, uint8_t seqIndex,
                                        size_t byteSize, xspi_target_group_t tgId, bool lockArbitration)
{
    uint32_t tgSfarsRegAddr     = (uint32_t)base + (uint32_t)s_tgSfarsRegOffset[(uint8_t)tgId];
    uint32_t sfpTgIpcrRegAddr   = (uint32_t)base + (uint32_t)s_sfpTgIpcrRegOffset[(uint8_t)tgId];
    uint32_t sfpTgIpSfarRegAddr = (uint32_t)base + (uint32_t)s_sfpTgIpSfarRegOffset[(uint8_t)tgId];
    uint32_t tgMdadRegAddr      = (uint32_t)base + (uint32_t)s_tgMdadRegOffset[(uint8_t)tgId];

    bool mdadEnabled = false;
    bool mdadValid   = false;

    XSPI_ClearErrorStatusFlags(base, kXSPI_ArbWinEventFlag);
    mdadEnabled = (bool)((base->MGC & XSPI_MGC_GVLDMDAD_MASK) != 0UL);
    mdadValid   = (((*(uint32_t *)tgMdadRegAddr) & XSPI_TG0MDAD_VLD_MASK) != 0UL);

    /* Check the selected target group queue is empty. */
    while (((*(volatile uint32_t *)tgSfarsRegAddr) & XSPI_TGSFARS_VLD_MASK) != 0UL)
    {
    }

    if (mdadEnabled && mdadValid)
    {
        if (tgId == kXSPI_TargetGroup0)
        {
            XSPI_EnableInterrupts(base, (uint64_t)(kXSPI_Tg0SfarErrIntEnable | kXSPI_Tg0IpcrErrIntEnable));
        }
        else
        {
            XSPI_EnableInterrupts(base, (uint64_t)(kXSPI_Tg1SfarErrIntEnable | kXSPI_Tg1IpcrErrIntEnable));
        }
    }

    /* Set target address. */
    (*(uint32_t *)sfpTgIpSfarRegAddr) = addr;
    /* Set transfer size and sequence ID. */
    (*(uint32_t *)sfpTgIpcrRegAddr) = XSPI_SFP_TG_IPCR_IDATSZ(byteSize) | XSPI_SFP_TG_IPCR_ARB_LOCK(lockArbitration) |
                                      XSPI_SFP_TG_IPCR_SEQID(seqIndex);

    if (mdadEnabled && mdadValid)
    {
        if (tgId == kXSPI_TargetGroup0)
        {
            XSPI_DisableInterrupts(base, (uint64_t)(kXSPI_Tg0SfarErrIntEnable | kXSPI_Tg0SfarErrIntEnable));
        }
        else
        {
            XSPI_DisableInterrupts(base, (uint64_t)(kXSPI_Tg1SfarErrIntEnable | kXSPI_Tg1SfarErrIntEnable));
        }

        if (g_IpAccessIpcrFail)
        {
            return kStatus_XSPI_IpAccessIPCRInvalid;
        }

        if (g_IpAccessSfarFail)
        {
            return kStatus_XSPI_IpAccessAddrSettingInvalid;
        }
    }

