Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
    XSPI_EnableInterrupts(base, (uint64_t)(kXSPI_ArbitrationWinIntEnable));

    return kStatus_Success;    
}

/***************************** IPS Access Control Low-Level Interfaces End ********************************/

/***************************** IPS Access Control Functional Interfaces Start ********************************/
/*!
 * brief Set IP access configurations, including SFP configurations, sfp arbitration lock timeout value, Ip access
 * timeout value.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] ptrIpAccessConfig Pointer to the variable which contains Ip access configurations.
 *
 * retval kStatus_XSPI_RegWriteLocked Write operation to related register is locked.
 * retval kStatus_Success Success to update timeout counter.
 */
status_t XSPI_SetIpAccessConfig(XSPI_Type *base, xspi_ip_access_config_t *ptrIpAccessConfig)
{
    assert(ptrIpAccessConfig != NULL);

    status_t status = kStatus_Success;

    XSPI_ClearIPAccessSeqPointer(base);
    XSPI_UpdateSFPConfig(base, ptrIpAccessConfig->ptrSfpMdadConfig, ptrIpAccessConfig->ptrSfpFradConfig);
    status = XSPI_UpdateSFPArbitrationLockTimeoutCounter(base, ptrIpAccessConfig->sfpArbitrationLockTimeoutValue);

    if (status == kStatus_Success)
    {
        status = XSPI_UpdateIPAccessTimeoutCounter(base, ptrIpAccessConfig->ipAccessTimeoutValue);
    }

    return status;
}

/*!
 * brief Sends a buffer of data bytes using blocking method.
 * note This function blocks via polling until all bytes have been sent.
 * param base XSPI peripheral base address
 * param buffer The data bytes to send
 * param size The number of data bytes to send
 * retval kStatus_Success write success without error
 * retval kStatus_XSPI_SequenceExecutionTimeout sequence execution timeout
 * retval kStatus_XSPI_IpCommandSequenceError IP command sequence error detected
 * retval kStatus_XSPI_IpCommandGrantTimeout IP command grant timeout detected
 */
status_t XSPI_WriteBlocking(XSPI_Type *base, uint8_t *buffer, size_t size)
{
    status_t result = kStatus_Success;
    uint32_t i      = 0;

    /* Blocking until TX buffer is unlocked. */
    while (XSPI_CheckTxBuffLockOpen(base) == false)
    {
    }

    base->TBCT = 256UL - ((uint32_t)size / 4UL - 1UL);
    /* Send data buffer */
    while (0U != size)
    {
        result = XSPI_CheckAndClearError(base, base->ERRSTAT);

        if (kStatus_Success != result)
        {
            return result;
        }

        /* Write watermark level data into tx fifo . */
        /* Write word aligned data into tx fifo. */
        for (i = 0U; i < (size / 4U); i++)
        {
            while (1UL == ((base->SR & XSPI_SR_TXFULL_MASK) >> XSPI_SR_TXFULL_SHIFT))
            {
            }
            base->TBDR = *(uint32_t *)buffer;
            buffer += 4U;
        }

        /* Adjust size by the amount processed. */
        size -= 4U * i;

        /* Write word un-aligned data into tx fifo. */
        if (0x00U != size)
        {
            uint32_t tempVal = 0x00U;

            for (uint32_t j = 0U; j < size; j++)
            {
                tempVal |= ((uint32_t)*buffer++ << (8U * j));
            }

            while (1UL == ((base->SR & XSPI_SR_TXFULL_MASK) >> XSPI_SR_TXFULL_SHIFT))
            {
            }
            base->TBDR = tempVal;
        }

        size = 0U;
    }

    /*clear TX Buffer Fill Flag*/
    base->FR = XSPI_FR_TBFF_MASK;

    while (XSPI_CheckIPAccessAsserted(base))
    {
    }

    return result;
}

/*!
 * brief Receives a buffer of data bytes using a blocking method.
 * note This function blocks via polling until all bytes have been sent.
 * param base XSPI peripheral base address
 * param buffer The data bytes to send
 * param size The number of data bytes to receive
 * retval kStatus_Success read success without error
 * retval kStatus_XSPI_SequenceExecutionTimeout sequence execution timeout
 * retval kStatus_XSPI_IpCommandSequenceError IP command sequence error detected
 * retval kStatus_XSPI_IpCommandGrantTimeout IP command grant timeout detected
 */
status_t XSPI_ReadBlocking(XSPI_Type *base, uint8_t *buffer, size_t size)
{
    assert(size <= XSPI_IP_RX_BUFFER_SIZE);

    uint32_t rxWatermark  = base->RBCT + 1UL;
    status_t status       = kStatus_Success;
    uint32_t i            = 0UL;
    uint32_t removedCount = 0UL;
    uint32_t pollingBitMask     = XSPI_SR_RXWE_MASK;

    if (XSPI_CheckFSMValid(base) == false)
    {
        XSPI_ClearRxBuffer(base);
        return kStatus_NoTransferInProgress;
    }

    if (size == XSPI_IP_RX_BUFFER_SIZE)
    {
        pollingBitMask = XSPI_SR_RXFULL_MASK;
    }

    while ((1UL != (base->SR & XSPI_SR_BUSY_MASK)) && (((base->SR & XSPI_SR_IP_ACC_MASK) >> XSPI_SR_IP_ACC_SHIFT) != 0UL))
    {
    }

      /* Loop until Rx buffer watermark exceeded status asserted. */
      while ((base->SR & pollingBitMask) == 0UL)
      {
          if((base->ERRSTAT & XSPI_ERRSTAT_TO_ERR_MASK) != 0UL)
          {
              XSPI_ClearRxBuffer(base);
              base->ERRSTAT = XSPI_ERRSTAT_TO_ERR_MASK;
              return kStatus_Timeout;
          }
      }

    uint32_t adjuestedSize = size + (4UL - size % 4UL) % 4UL;

    if (XSPI_GetRxBufferAvailableBytesCount(base) != adjuestedSize)
    {
        XSPI_ClearRxBuffer(base);
        return kStatus_XSPI_RxBufferEntriesCountError;
    }
    /* Send data buffer */
    while (0UL != size)
    {
        status = XSPI_CheckAndClearError(base, base->ERRSTAT);

        if (kStatus_Success != status)
        {
            break;
        }

        /* Read word aligned data from rx fifo. */
        if (size >= 4UL * rxWatermark)
        {
            removedCount = XSPI_GetRxBufferRemovedBytesCount(base);
            for (i = 0UL; i < rxWatermark; i++)
            {
                *(uint32_t *)buffer = base->RBDR[i];
                buffer += 4UL;
            }

            /* RX buffer POP, trigger RX pop event. */
            XSPI_TriggerRxBufferPopEvent(base);
            while ((XSPI_GetRxBufferRemovedBytesCount(base) - removedCount) != (rxWatermark * 4UL))
            {
            }
            size = size - 4UL * rxWatermark;
        }
        else
        {
            for (i = 0UL; i < (size / 4UL); i++)
            {
                *(uint32_t *)buffer = base->RBDR[i];
                buffer += 4UL;
            }

