Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
            /* Adjust size by the amount processed. */
            size -= 4UL * i;

            /* Read word un-aligned data from rx fifo. */
            if (0UL != size)
            {
                uint32_t tempVal = base->RBDR[i];

                for (i = 0U; i < size; i++)
                {
                    *buffer++ = ((uint8_t)(tempVal >> (8U * i)) & 0xFFU);
                }
            }

            size = 0UL;
        }
    }

    /* Clear Rx buffer after all entries are read out. */
    XSPI_ClearRxBuffer(base);

    return status;
}

/*!
 * brief Execute command to transfer a buffer data bytes using a blocking method.
 * param base XSPI peripheral base address
 * param xfer pointer to the transfer structure.
 * retval kStatus_Success command transfer success without error
 * retval kStatus_XSPI_SequenceExecutionTimeout sequence execution timeout
 * retval kStatus_XSPI_IpCommandSequenceError IP command sequence error detected
 * retval kStatus_XSPI_IpCommandGrantTimeout IP command grant timeout detected
 */
status_t XSPI_TransferBlocking(XSPI_Type *base, xspi_transfer_t *xfer)
{
    status_t status    = kStatus_Success;
    uint32_t dataSize  = xfer->dataSize;
    uint8_t *ptrBuffer = (uint8_t *)xfer->data;
    uint32_t transferSize      = 0UL;
    uint32_t addr = xfer->deviceAddress;

    if ((xfer->cmdType == kXSPI_Write) || (xfer->cmdType == kXSPI_Config))
    {
        while(dataSize > 0UL)
        {
            if (dataSize <= g_programFlashSize)
            {
                transferSize = dataSize;
            }
            else
            {
                transferSize = g_programFlashSize;
            }

            status = XSPI_StartIpAccess(base, addr, xfer->seqIndex, transferSize, xfer->targetGroup,
                                    xfer->lockArbitration);
            if (status != kStatus_Success)
            {
                return status;
            }

            /* Clear TX buffer pointer. */
            XSPI_ClearTxBuffer(base);

            status = XSPI_WriteBlocking(base, ptrBuffer, transferSize);
            if (status != kStatus_Success)
            {
                return status;
            }
            dataSize -= transferSize;
            
            if (dataSize != 0UL)
            {
                ptrBuffer += transferSize;
                addr += transferSize;
            }
        }
    }
    else if (xfer->cmdType == kXSPI_Read)
    {
        uint32_t rxBufferWaterMark = 0UL;
        while (dataSize > 0UL)
        {
            XSPI_ClearRxBuffer(base);

            /* calculate watermark and transfer size based on data size. */
            if (dataSize >= XSPI_IP_RX_BUFFER_SIZE)
            {
                /* In case of data size bigger than RX buffer size, the big size request should be
                break into small size sub-request, and the transfer size of sub-request is equal to buffer size. */
                rxBufferWaterMark = XSPI_IP_RX_BUFFER_SIZE >> 1UL;
                transferSize      = XSPI_IP_RX_BUFFER_SIZE;
            }
            else if (dataSize > (XSPI_IP_RX_BUFFER_SIZE >> 1UL))
            {
                /* In case of data size bigger than maximum watermark value, watermark set as maximum value, and
                transfer size is data size. */
                rxBufferWaterMark = XSPI_IP_RX_BUFFER_SIZE >> 1UL;
                transferSize      = dataSize;
            }
            else if (dataSize % 4UL == 0UL)
            {
                /* In case of data size less than maximum watermark value and is aligned with 4 bytes, watermark set
                as data size, transfer size also set as data size. */
                rxBufferWaterMark = dataSize;
                transferSize      = dataSize;
            }
            else
            {
                /* In case of data size is not 4-byte aligned, watermark set as closest value, and transfer size
                set as data size. */
                rxBufferWaterMark = (dataSize / 4UL) << 2UL;
                if (rxBufferWaterMark == 0UL)
                {
                    rxBufferWaterMark = 4UL;
                }
                transferSize = dataSize;
            }
            (void)XSPI_UpdateRxBufferWaterMark(base, rxBufferWaterMark);

            status =
                XSPI_StartIpAccess(base, addr, xfer->seqIndex, transferSize, xfer->targetGroup, false);
            if (status != kStatus_Success)
            {
                return status;
            }
            status = XSPI_ReadBlocking(base, ptrBuffer, transferSize);
            if (status == kStatus_Timeout)
            {
                XSPI_ResetTgQueue(base);
                XSPI_ResetSfmAndAhbDomain(base);
                break;
            }
            dataSize -= transferSize;
            if (dataSize != 0UL)
            {
                ptrBuffer += transferSize;
                addr += transferSize;
            }
        }
    }
    else
    {
        /* Set command. */
        status = XSPI_StartIpAccess(base, xfer->deviceAddress, xfer->seqIndex, 0UL, xfer->targetGroup,
                                    xfer->lockArbitration);
        if (status != kStatus_Success)
        {
            return status;
        }
    }

    /* Wait for bus to be idle before changing flash configuration. */
    while (!XSPI_GetBusIdleStatus(base))
    {
    }

    if (xfer->cmdType == kXSPI_Command)
    {
        status = XSPI_CheckAndClearError(base, base->ERRSTAT);
        while (XSPI_CheckIPAccessAsserted(base))
        {
        }
    }

    return status;
}

/*!
 * brief Initializes the XSPI handle which is used in transactional functions.
 *
 * param base XSPI peripheral base address.
 * param handle pointer to xspi_handle_t structure to store the transfer state.
 * param callback pointer to user callback function.
 * param userData user parameter passed to the callback function.
 */
void XSPI_TransferCreateHandle(XSPI_Type *base,
                               xspi_handle_t *handle,
                               xspi_transfer_callback_t callback,
                               void *userData)
{
    assert(NULL != handle);

    uint32_t instance = XSPI_GetInstance(base);

    /* Zero handle. */
    (void)memset(handle, 0, sizeof(*handle));

    /* Set callback and userData. */
    handle->completionCallback = callback;
    handle->userData           = userData;

    /* Enable NVIC interrupt. */
    (void)EnableIRQ(s_xspiIrqs[instance]);

#if defined(FSL_DRIVER_TRANSFER_DOUBLE_WEAK_IRQ) && FSL_DRIVER_TRANSFER_DOUBLE_WEAK_IRQ
    s_xspiHandle[instance] = handle;
#endif
}


/*!
 * brief Performs a interrupt non-blocking transfer on the XSPI bus.
 *
 * note Calling the API returns immediately after transfer initiates. The user needs
 * to call XSPI_GetTransferCount to poll the transfer status to check whether
 * the transfer is finished. If the return status is not kStatus_XSPI_Busy, the transfer
 * is finished. For XSPI_Read, the dataSize should be multiple of rx watermark level, or
 * XSPI could not read data properly.
 *
 * param base XSPI peripheral base address.
 * param handle pointer to xspi_handle_t structure which stores the transfer state.
 * param xfer pointer to xspi_transfer_t structure.
 * retval kStatus_Success Successfully start the data transmission.
 * retval kStatus_XSPI_Busy Previous transmission still not finished.
 */
status_t XSPI_TransferNonBlocking(XSPI_Type *base, xspi_handle_t *handle, xspi_transfer_t *xfer)
{
    status_t status = kStatus_Success;
    uint32_t instance = XSPI_GetInstance(base);

    assert(NULL != handle);
    assert(NULL != xfer);

    /* Check if the I2C bus is idle - if not return busy status. */
    if (handle->state != (uint32_t)kXSPI_StateIdle)
    {
        status = kStatus_XSPI_Busy;
    }
    else
    {
        handle->dataSize = xfer->dataSize;
        handle->transferTotalSize = xfer->dataSize;
        handle->data = (uint8_t *)xfer->data;
        s_xspiTransfer[instance] = xfer;

        if (xfer->cmdType == kXSPI_Read)
        {

