Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
            status = XSPI_StartIpReadNonBlocking(base, handle, xfer->dataSize);
        }
        else if ((xfer->cmdType == kXSPI_Config) || (xfer->cmdType == kXSPI_Write))
        {
            status = XSPI_StartIpWriteNonBlocking(base, handle, xfer->dataSize);
        }
        else
        {
            handle->state = kXSPI_StateStartIpAccess;
            status = XSPI_StartIpAccessNonBlocking(base, xfer->deviceAddress, xfer->seqIndex, 0UL, xfer->targetGroup,
                                                xfer->lockArbitration);
            if (status != kStatus_Success)
            {
                return status;
            }
            if (handle->state != kXSPI_StateIpAccessGranted)
            {
                status = kStatus_XSPI_IpAccessNotGranted;
            }
            else
            {
                handle->state = kXSPI_StateIdle;
                status = kStatus_Success;
            }
        }
    }

    return status;
}

/*!
 * brief Gets the master transfer status during a interrupt non-blocking transfer.
 *
 * param base XSPI peripheral base address.
 * param handle pointer to xspi_handle_t structure which stores the transfer state.
 * param count Number of bytes transferred so far by the non-blocking transaction.
 * retval kStatus_InvalidArgument count is Invalid.
 * retval kStatus_Success Successfully return the count.
 */
status_t XSPI_TransferGetCount(XSPI_Type *base, xspi_handle_t *handle, size_t *count)
{
    (void)base;
    assert(NULL != handle);

    status_t status = kStatus_Success;

    if (handle->state == (uint32_t)kXSPI_StateIdle)
    {
        status = kStatus_NoTransferInProgress;
    }
    else
    {
        *count = handle->transferTotalSize - handle->dataSize;
    }

    return status;
}

/*!
 * brief Aborts an interrupt non-blocking transfer early.
 *
 * note This API can be called at any time when an interrupt non-blocking transfer initiates
 * to abort the transfer early.
 *
 * param base XSPI peripheral base address.
 * param handle pointer to xspi_handle_t structure which stores the transfer state
 */
void XSPI_TransferAbort(XSPI_Type *base, xspi_handle_t *handle)
{
    assert(NULL != handle);

    XSPI_DisableInterrupts(base, (uint64_t)(kXSPI_RxBufferDrainIntEnable | kXSPI_RxBufferOverflowIntEnable |
                            kXSPI_TimeoutErrIntEnable | kXSPI_IpCmdTrigFailErrorIntEnable |
                            kXSPI_TxBufferFillIntEnable | kXSPI_TxBufferUnderrunIntEnable|
                            kXSPI_TimeoutErrIntEnable | kXSPI_IpCmdTrigFailErrorIntEnable | 
                            kXSPI_ArbitrationWinIntEnable));
    handle->state = (uint32_t)kXSPI_StateIdle;
}

/***************************** IPS Access Control Functional Interfaces End ********************************/

/***************************** AHB Access Control Low-Level Interfaces Start ********************************/
/*!
 * brief Set AHB transaction(read/write) boundary.
 *
 * note For AHB write, XSPI keeps track of the start address and then compares it with the address of subsequent
 * transaction receive on the AHB bus, when the input alignment is reached, XSPI negates AHB HREADY to block new
 * accesses. This signal will be kept low until all the previous received write data is written to external memory and
 * chip select is de-asserted. After that it allows next AHB write data to be received by making HREADY high thus
 * ensuring that transaction is split at address boundary on external memory.
 *
 * note For AHB read, XSPI checks the start address and end address to see if it is crossing the address boundary
 * specified by input alignment. If the transaction crosses the address boundary, then it reduces the transaction size
 * such that the data pre-fetch is stopped before the address boundary. Now if the AHB master is reading the data
 * sequentially it will get buffer hits up to the input alignment boundary. When it reaches the next address boundary
 * it will get a buffer miss and a new data pre-fetch will be launched towards the external memory device.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] alignment Specify the AHB alignment, in type of ref xspi_ahb_alignment_t.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted
 * retval kStatus_XSPI_RegWriteLocked Fail due to write operation to related registers is locked.
 * retval kStatus_Success Success to set AHB access boundary.
 */
status_t XSPI_SetAhbAccessBoundary(XSPI_Type *base, xspi_ahb_alignment_t alignment)
{
#if defined(XSPI_BFGENCR_ALIGN_MASK)
    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    if (XSPI_CheckGlobalConfigLocked(base))
    {
        return kStatus_XSPI_RegWriteLocked;
    }

    base->BFGENCR = ((base->BFGENCR & ~(XSPI_BFGENCR_ALIGN_MASK)) | XSPI_BFGENCR_ALIGN(alignment));
#endif /* defined(XSPI_BFGENCR_ALIGN_MASK) */
    
    return kStatus_Success;
}
/*!
 * brief Set AHB read sequence Id.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] seqId Specify the sequence Id in LUT used for AHB read.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted
 * retval kStatus_XSPI_RegWriteLocked Fail due to write operation to related registers is locked.
 * retval kStatus_Success Success to set AHB read sequence Id.
 */
status_t XSPI_SetAhbReadDataSeqId(XSPI_Type *base, uint8_t seqId)
{
    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    if (XSPI_CheckGlobalConfigLocked(base))
    {
        return kStatus_XSPI_RegWriteLocked;
    }

    base->BFGENCR = ((base->BFGENCR & (~XSPI_BFGENCR_SEQID_MASK)) | XSPI_BFGENCR_SEQID(seqId));

    return kStatus_Success;
}
/*!
 * brief Set AHB write sequence Id.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] seqId Specify the sequence Id in LUT used for AHB write.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted
 * retval kStatus_XSPI_RegWriteLocked Fail due to write operation to related registers is locked.
 * retval kStatus_Success Success to set AHB write sequence Id.
 */
status_t XSPI_SetAhbWriteDataSeqId(XSPI_Type *base, uint8_t seqId)
{
    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

