Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    if (XSPI_CheckGlobalConfigLocked(base))
    {
        return kStatus_XSPI_RegWriteLocked;
    }

    base->BFGENCR = ((base->BFGENCR & (~XSPI_BFGENCR_SEQID_WR_MASK)) | XSPI_BFGENCR_SEQID_WR(seqId));

    return kStatus_Success;
}
/*!
 * brief Set AHB buffer configurations.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] ptrBuffer0Config Pointer to the variable which contain buffer0 configurations.
 * param[in] ptrBuffer1Config Pointer to the variable which contain buffer1 configurations. 
 * param[in] ptrBuffer2Config Pointer to the variable which contain buffer2 configurations.
 * param[in] ptrBuffer3Config Pointer to the variable which contain buffer3 configurations.
 * 
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted.
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted.
 * retval kStatus_Success Success to set AHB buffer configurations.
 */
status_t XSPI_SetAhbBufferConfig(XSPI_Type *base,
                                 xspi_ahbBuffer_config_t *ptrBuffer0Config,
                                 xspi_ahbBuffer_config_t *ptrBuffer1Config,
                                 xspi_ahbBuffer_config_t *ptrBuffer2Config,
                                 xspi_ahbBuffer_config_t *ptrBuffer3Config)
{
    assert(ptrBuffer0Config != NULL);
    assert(ptrBuffer1Config != NULL);
    assert(ptrBuffer2Config != NULL);
    assert(ptrBuffer3Config != NULL);

    assert((ptrBuffer0Config->bufferSize + ptrBuffer1Config->bufferSize + ptrBuffer2Config->bufferSize +
            ptrBuffer3Config->bufferSize) == 512U);

    xspi_ahbBuffer_config_t *ahbBufferConfigs[4];
    uint32_t subBufferStartAddr; /* Specify the upper 16-bits of the start address range. */
    uint32_t subBufferEndAddr;   /* Specify the upper 16-bits of the end address range. */
    xspi_ahbBuffer_sub_buffer_config_t *curSubBufferConfig = NULL;

    ahbBufferConfigs[0] = ptrBuffer0Config;
    ahbBufferConfigs[1] = ptrBuffer1Config;
    ahbBufferConfigs[2] = ptrBuffer2Config;
    ahbBufferConfigs[3] = ptrBuffer3Config;
    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    (void)XSPI_UpdateAhbBufferSize(base, ptrBuffer0Config->bufferSize, ptrBuffer1Config->bufferSize,
                                   ptrBuffer2Config->bufferSize, ptrBuffer3Config->bufferSize);

    for (uint8_t i = 0U; i < XSPI_BUFCR_COUNT; i++)
    {
        /* The buffer size is set as transfer size, because when buffer-miss the
        XSPI will clear AHB buffer and fetch size of data from external device.
        If transfer size is less than buffer size, then left space will never used. */
        base->BUFCR[i] =
            XSPI_BUFCR_MSTRID(ahbBufferConfigs[i]->masterId) | XSPI_BUFCR_ADATSZ(ahbBufferConfigs[i]->bufferSize);

        /* Same bit field represent different feature for different AHB buffer. */
        if ((i == 0U) || (i == 1U))
        {
            base->BUFCR[i] |= XSPI_BUFCR_HP_EN(ahbBufferConfigs[i]->enaPri.enablePriority);
        }

        if (i == 3U)
        {
            base->BUFCR[i] |= XSPI_BUFCR_ALLMST(ahbBufferConfigs[i]->enaPri.enableAllMaster);
        }

        if ((ahbBufferConfigs[i]->ptrSubBuffer0Config == NULL) && (ahbBufferConfigs[i]->ptrSubBuffer1Config == NULL) &&
            (ahbBufferConfigs[i]->ptrSubBuffer2Config == NULL) && (ahbBufferConfigs[i]->ptrSubBuffer3Config == NULL))
        {
            base->BUFCR[i] &= ~XSPI_BUFCR_SUB_DIV_EN_MASK;
        }
        else
        {
            if (((1U << (4U - (uint8_t)(ahbBufferConfigs[i]->ptrSubBuffer0Config->divFactor))) +
                 (1U << (4U - (uint8_t)(ahbBufferConfigs[i]->ptrSubBuffer1Config->divFactor))) +
                 (1U << (4U - (uint8_t)(ahbBufferConfigs[i]->ptrSubBuffer2Config->divFactor)))) > 16U)
            {
                return kStatus_XSPI_AhbSubBufferFactorError;
            }

            base->BUFCR[i] |= XSPI_BUFCR_SUB_DIV_EN_MASK |
                              XSPI_BUFCR_SUBBUF0_DIV(ahbBufferConfigs[i]->ptrSubBuffer0Config->divFactor) |
                              XSPI_BUFCR_SUBBUF1_DIV(ahbBufferConfigs[i]->ptrSubBuffer1Config->divFactor) |
                              XSPI_BUFCR_SUBBUF1_DIV(ahbBufferConfigs[i]->ptrSubBuffer2Config->divFactor);

            /* Set AHB buffer sub buffer start and end address range. */
            for (uint8_t j = 0U; j < XSPI_BUF_ADDR_RANGE_COUNT2; j++)
            {
                curSubBufferConfig =
                    (xspi_ahbBuffer_sub_buffer_config_t *)(ahbBufferConfigs[i]->ptrSubBuffer0Config) + j;
                subBufferStartAddr = ((curSubBufferConfig->startAddr) & 0xFFFF0000UL) >> 16UL;
                subBufferEndAddr   = ((curSubBufferConfig->endAddr) & 0xFFFF0000UL) >> 16UL;

                base->BUF_ADDR_RANGE[i][j] =
                    XSPI_BUF_ADDR_RANGE_STARTADR(subBufferStartAddr) | XSPI_BUF_ADDR_RANGE_ENDADR(subBufferEndAddr);

                if (curSubBufferConfig->enableAhbMonitor)
                {
                    /* Enable AHB monitor to current sub division. */
                    XSPI_EnableAhbBufferPerfMonitor(base, i, j);
                }
            }
        }
    }
    return kStatus_Success;
}

/*!
 * brief Set AHB transaction(read/write) split size.
 *
 * note For AHB write, if enable split feature(ahbSplitSize not set as kXSPI_AhbSplitSizeDisabled), XSPI will split one
 * single AHB write burst into smaller bursts on external device side.
 *
 * note For AHB read, if enable split feature, HW will realign the prefetch size to split size and in that way split
 * a single read burst into smaller bursts.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] ahbSplitSize Specify the AHB split size.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted
 * retval kStatus_XSPI_RegWriteLocked Fail due to write operation to related registers is locked.
 * retval kStatus_Success Success to set AHB access split size.
 */
status_t XSPI_SetAhbAccessSplitSize(XSPI_Type *base, xspi_ahb_split_size_t ahbSplitSize)
{
    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

