Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    if (XSPI_CheckGlobalConfigLocked(base))
    {
        return kStatus_XSPI_RegWriteLocked;
    }

    if (ahbSplitSize == kXSPI_AhbSplitSizeDisabled)
    {
        base->BFGENCR &= ~XSPI_BFGENCR_SPLITEN_MASK;
    }
    else
    {
        base->BFGENCR |= XSPI_BFGENCR_SPLITEN_MASK;
        base->BFGENCR = (base->BFGENCR & (~XSPI_BFGENCR_AHBSSIZE_MASK)) | XSPI_BFGENCR_AHBSSIZE(ahbSplitSize);
    }

    return kStatus_Success;
}

/*!
 * brief Specify how long XSPI can hold HEADY low while waiting for response to an AHB transfer.
 *
 * note If the specified time out value expired, an AHB illegal transaction error will be triggerred.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] timeoutValue In multiples of 50000 AHB clock cycles, default value is 3,
 *                      it means waiting for 150000 AHB clock cycles.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted
 * retval kStatus_Success Success to set AHB HREADY timeout value.
 */
status_t XSPI_UpdateAhbHreadyTimeOutValue(XSPI_Type *base, uint16_t timeoutValue)
{
    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    base->AHRDYTO = XSPI_AHRDYTO_HREADY_TO(timeoutValue);

    return kStatus_Success;
}

/*!
 * brief Pre-define error payload which will be provided on the read data bus when the HEADY timeout counter expires.
 *
 * note If the incoming AHB read request master is not mapped to any of the AHB buffer, the XSPI will keep the AHB
 * HREADY signal low and will provided this pre-defined error payload on the AHB read data bus when the HEADY timeout
 * counter expires.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] highPayload High 32bits payload to set.
 * param[in] lowPayload Low 32bits payload to set.

 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted
 * retval kStatus_Success Success to set AHB HREADY timeout value.
 */
status_t XSPI_SetAhbErrorPayload(XSPI_Type *base, uint32_t highPayload, uint32_t lowPayload)
{
    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    base->AHB_ERR_PAYLOAD_HI = highPayload;
    base->AHB_ERR_PAYLOAD_LO = lowPayload;

    return kStatus_Success;
}

/*!
 * brief Return AHB read error information.
 * 
 * param[in] base XSPI peripheral base address.
 *
 * return Latest AHB read error information, in type of xspi_ahb_read_error_info_t.
 */
xspi_ahb_read_error_info_t XSPI_ReturnAhbReadErrorInfo(XSPI_Type *base)
{
    xspi_ahb_read_error_info_t errorInfo;

    errorInfo.errorAddr   = base->AHB_RD_ERR_ADDR;
    errorInfo.errMasterId = (uint8_t)(base->AHB_RD_ERR_MID & XSPI_AHB_RD_ERR_MID_REMID_MASK);

    return errorInfo;
}

/*!
 * brief Get Ahb request suspend information if priority mechanism is enabled.
 *
 * param[in] base XSPI peripheral base address.
 * param[out] ptrSuspendInfo Contain latest suspend info, the value may be 0xFF if the item is invalid in current
 * suspend state.
 */
void XSPI_GetAhbRequestSuspendInfo(XSPI_Type *base, xspi_ahb_request_suspend_info_t *ptrSuspendInfo)
{
    uint32_t tmp32 = 0UL;

    tmp32 = base->SPNDST;

    ptrSuspendInfo->state       = (xspi_ahb_request_suspend_state_t)(uint8_t)(tmp32 & XSPI_SPNDST_STATE_MASK);
    ptrSuspendInfo->subBufferId = 0xFFU;
    ptrSuspendInfo->ahbBufferId = 0xFFU;
    ptrSuspendInfo->dataLeft    = 0xFFFFU;
    ptrSuspendInfo->address     = 0xFFFFFFFFUL;

    if ((ptrSuspendInfo->state == kXSPI_AhbRequestSuspended) || (ptrSuspendInfo->state == kXSPI_AhbReqestResumed))
    {
        ptrSuspendInfo->subBufferId = (uint8_t)((tmp32 & XSPI_SPNDST_SPDSBUF_MASK) >> XSPI_SPNDST_SPDSBUF_SHIFT);
        ptrSuspendInfo->ahbBufferId = (uint8_t)((tmp32 & XSPI_SPNDST_SPDBUF_MASK) >> XSPI_SPNDST_SPDBUF_SHIFT);
        ptrSuspendInfo->dataLeft    = (uint16_t)((tmp32 & XSPI_SPNDST_DATLFT_MASK) >> XSPI_SPNDST_DATLFT_SHIFT);

        if (ptrSuspendInfo->state == kXSPI_AhbRequestSuspended)
        {
            ptrSuspendInfo->address = base->SPNDST_ADDR;
        }
    }
}

/*!
 * brief Enable/disable the clearing of AHB read prefetch buffers when the same flash address is written by an
 *   AHB or IP command.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] enable Used to enable/disable write flush.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted.
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted.
 * retval kStatus_Success Successfully to enable/disable AHB buffer write flush.
 */
status_t XSPI_EnableAhbBufferWriteFlush(XSPI_Type *base, bool enable)
{
    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    if (XSPI_CheckGlobalConfigLocked(base))
    {
        return kStatus_XSPI_RegWriteLocked;
    }

    if (enable)
    {
        base->BFGENCR |= XSPI_BFGENCR_WR_FLUSH_EN_MASK;
    }
    else
    {
        base->BFGENCR &= ~XSPI_BFGENCR_WR_FLUSH_EN_MASK;
    }

    return kStatus_Success;
}

/*!
 * brief Block access(write and read) after the AHB write operation.
 *
 * note If external flash support RWW, read should not be blocked:
 * code
 *  XSPI_BlockAccessAfterAhbWrite(XSPI0, true, false);
 * endcode
 *
 * note If either of access is blocked, the page program wait flag will be asserted after
 * an AHB write sequence completed. The assertion of flag will lock the arbitration and all
 * access to the external memory are blocked. And the internal "page wait time" counter
 * starts(Invoke XSPI_UpdatePageWaitTimeCounter to update counter value). After this counter
 * reaches the value, a read is triggered by the XSPI module to read external device's
 * status register(The seq id should be pre-defiend by XSPI_SetAhbReadStatusRegSeqId),
 * and the value is stored in the XSPI internal regsiter. And there are two
 * options(Invoke XSPI_SelectPPWFlagClearPolicy to select) to clear the asserted page program wait flag.
 *      1. Automatic cleared by XSPI hardware;
 *      2. Cleared by software.
 *
 * note As soon as the page program wait flag is asserted, another counter(SFP arbitration
 * lock counter) also started, if the flag not cleared in desired counter value the
 * arbitration lock timeout error will be generated.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] blockSequentWrite Block sequence write or not.
 * param[in] blockRead Block read or not.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted
 * retval kStatus_Success Success to set related registers..
 */
status_t XSPI_BlockAccessAfterAhbWrite(XSPI_Type *base, bool blockSequentWrite, bool blockRead)
{
    uint32_t tmp32 = 0UL;

    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

