Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    tmp32 = base->AWRCR;
    tmp32 &= ~(XSPI_AWRCR_PPW_RD_DIS_MASK | XSPI_AWRCR_PPW_WR_DIS_MASK);
    tmp32 |= XSPI_AWRCR_PPW_RD_DIS(blockRead) | XSPI_AWRCR_PPW_WR_DIS(blockSequentWrite);

    base->AWRCR = tmp32;

    return kStatus_Success;
}

/*!
 * brief Set Page program wait flag clear policy.
 * 
 * note If set as hardware policy, the device's WIP information should be set by invoking XSPI_SetSFMStatusRegInfo()
 *
 * param[in] base XSPI peripheral base address.
 * param[in] policy Specify the policy to clear page program wait flag.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted
 * retval kStatus_XSPI_RegWriteLocked Fail due to write operation to related registers is locked.
 * retval kStatus_Success Success to set PPW flag clear policy.
 */
status_t XSPI_SelectPPWFlagClearPolicy(XSPI_Type *base, xspi_ppw_flag_clear_policy_t policy)
{
    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    if (XSPI_CheckGlobalConfigLocked(base))
    {
        return kStatus_XSPI_RegWriteLocked;
    }

    if (policy == kXSPI_HardwareClearPPWFlag)
    {
        base->BFGENCR |= XSPI_BFGENCR_PPWF_CLR_MASK;
    }
    else
    {
        base->BFGENCR &= ~XSPI_BFGENCR_PPWF_CLR_MASK;
    }

    return kStatus_Success;
}

/*!
 * brief Update page wait timeout counter.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] countValue The value of counter, in AHB clock cycles.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted
 * retval kStatus_XSPI_PageProgramWaitFlagAsserted Page program wait flag already asserted.
 * retval kStatus_Success Successfully to update page wait timeout counter.
 */
status_t XSPI_UpdatePageWaitTimeCounter(XSPI_Type *base, uint32_t countValue)
{
    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;

    }
    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    if ((base->FR & XSPI_FR_PPWF_MASK) != 0UL)
    {
        return kStatus_XSPI_PageProgramWaitFlagAsserted;
    }

    base->PPWF_TCNT = countValue;

    return kStatus_Success;
}

/*!
 * brief Set AHB read status register sequence Id
 *
 * note The read status sequence only triggerred when the page wait time counter expired.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] seqId Specify the sequence Id in LUT used for AHB read status register.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted
 * retval kStatus_XSPI_RegWriteLocked Fail due to write operation to related registers is locked.
 * retval kStatus_Success Success to set AHB read status register sequence Id.
 */
status_t XSPI_SetAhbReadStatusRegSeqId(XSPI_Type *base, uint8_t seqId)
{
    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    if (XSPI_CheckGlobalConfigLocked(base))
    {
        return kStatus_XSPI_RegWriteLocked;
    }

    base->BFGENCR = ((base->BFGENCR & (~XSPI_BFGENCR_SEQID_RDSR_MASK)) | XSPI_BFGENCR_SEQID_RDSR(seqId));

    return kStatus_Success;
}

/*!
 * brief Set Serial flash memory status register information
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] ptrStatusRegInfo Pointer to the variable which contain status register information.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted
 * retval kStatus_XSPI_PageProgramWaitFlagAsserted Page program wait flag already asserted.
 * retval kStatus_Success Successfully to set status register information.
 */
status_t XSPI_SetSFMStatusRegInfo(XSPI_Type *base, xspi_device_status_reg_info_t *ptrStatusRegInfo)
{
    assert(ptrStatusRegInfo != NULL);

    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    if ((base->FR & XSPI_FR_PPWF_MASK) != 0UL)
    {
        return kStatus_XSPI_PageProgramWaitFlagAsserted;
    }

    uint32_t tmp32 = 0UL;

    tmp32 = (base->PPW_RDSR) &
            ~(XSPI_PPW_RDSR_RDSR_VAL_CHK_MASK | XSPI_PPW_RDSR_RDSR_HWORD_SEL_MASK | XSPI_PPW_RDSR_LOC_MASK);

    tmp32 |= XSPI_PPW_RDSR_RDSR_VAL_CHK(ptrStatusRegInfo->value1Expired) |
             XSPI_PPW_RDSR_RDSR_HWORD_SEL(ptrStatusRegInfo->upperHalfWordSelected) |
             XSPI_PPW_RDSR_LOC(ptrStatusRegInfo->wipLocation);

    base->PPW_RDSR = tmp32;

    return kStatus_Success;
}

/*!
 * brief Set Buffer size for all 4 AHB buffers.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] buf0Size Specify size of AHB buffer0, range of 512, 256, 128, 64, 32, 16, 8, 4, 2, 0.
 * param[in] buf1Size Specify size of AHB buffer1, range of 512, 256, 128, 64, 32, 16, 8, 4, 2, 0.
 * param[in] buf2Size Specify size of AHB buffer2, range of 512, 256, 128, 64, 32, 16, 8, 4, 2, 0.
 * param[in] buf3Size Specify size of AHB buffer3, range of 512, 256, 128, 64, 32, 16, 8, 4, 2, 0.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted.
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted.
 * retval kStatus_Success Success to set AHB buffer size.
 */
status_t XSPI_UpdateAhbBufferSize(
    XSPI_Type *base, uint16_t buf0Size, uint16_t buf1Size, uint16_t buf2Size, uint16_t buf3Size)
{
    /* The total size of AHB buffer is 4KB. */
    assert((buf0Size + buf1Size + buf2Size + buf3Size) == 512U);

    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

