Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    base->BUFIND[0] = XSPI_BUFIND_TPINDX(buf0Size);
    base->BUFIND[1] = XSPI_BUFIND_TPINDX((uint32_t)buf0Size + (uint32_t)buf1Size);
    base->BUFIND[2] = XSPI_BUFIND_TPINDX((uint32_t)buf0Size + (uint32_t)buf1Size + (uint32_t)buf2Size);

    (void)buf3Size;

    return kStatus_Success;
}

/*!
 * brief Get status of AHB sub buffer.
 *
 * note This function only useful when sub-division feature of the selected AHB buffer is enabled.
 *
 * param[in] base XSPI peripheral base address.
 * param[in] ahbBufferId The Id of AHB buffer, range from 0 to 3.
 * param[in] subBufferId The Id of AHB buffer sub division, range from 0 to 3.
 *
 * return Current status of selected AHB sub buffer, in type of ref xspi_ahb_sub_buffer_status_t.
 */
xspi_ahb_sub_buffer_status_t XSPI_GetAhbSubBufferStatus(XSPI_Type *base, uint8_t ahbBufferId, uint8_t subBufferId)
{
    uint32_t tmp32 = 0UL;
    uint32_t shift = 8UL * (uint32_t)ahbBufferId + 2UL * (uint32_t)subBufferId;
    uint32_t mask  = 0x3UL << shift;

    tmp32 = base->AHB_BUF_STATUS;
    return (xspi_ahb_sub_buffer_status_t)(uint32_t)((tmp32 & mask) >> shift);
}

/*!
 * brief Enable AHB buffer performance monitor for selected AHB buffer's sub buffer.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] ahbBufferId Specify the selected AHB buffer.
 * param[in] subBufferId Specify the selected sub-buffer.
 */
void XSPI_EnableAhbBufferPerfMonitor(XSPI_Type *base, uint8_t ahbBufferId, uint8_t subBufferId)
{
    uint32_t tmp32 = 0UL;

    tmp32 = base->AHB_PERF_CTRL;

    tmp32 &= ~(XSPI_AHB_PERF_CTRL_SUB_BUF_SEL0_MASK << (2UL * (uint32_t)ahbBufferId));
    tmp32 |= XSPI_AHB_PERF_CTRL_SUB_BUF_SEL0(subBufferId) << (2UL * (uint32_t)ahbBufferId);

    tmp32 |= (uint32_t)XSPI_AHB_PERF_CTRL_BUF0_EN_MASK << (uint32_t)(ahbBufferId);

    base->AHB_PERF_CTRL = tmp32;
}
/***************************** AHB Access Control Low-Level Interfaces End ********************************/

/***************************** AHB Access Control Functional Interfaces Start ********************************/
/*!
 * brief Set AHB access configuration.
 * 
 * param[in] base XSPI peripheral base address.
 * param[in] ptrAhbAccessConfig Pointer to the variable which contains AHB access configurations.
 *
 * retval kStatus_XSPI_AhbReadAccessAsserted Fail due to an AHB read access already asserted
 * retval kStatus_XSPI_AhbWriteAccessAsserted Fail due to an AHB write access already asserted
 * retval kStatus_XSPI_RegWriteLocked Fail due to write operation to related registers is locked.
 * retval kStatus_Success Success to set AHB read status register sequence Id.
 */
status_t XSPI_SetAhbAccessConfig(XSPI_Type *base, xspi_ahb_access_config_t *ptrAhbAccessConfig)
{
    assert(ptrAhbAccessConfig != NULL);

    if (XSPI_CheckAhbReadAccessAsserted(base))
    {
        return kStatus_XSPI_AhbReadAccessAsserted;
    }

    if (XSPI_CheckAhbWriteAccessAsserted(base))
    {
        return kStatus_XSPI_AhbWriteAccessAsserted;
    }

    if (XSPI_CheckGlobalConfigLocked(base))
    {
        return kStatus_XSPI_RegWriteLocked;
    }

    /* Configure AHB buffers. */
    (void)XSPI_SetAhbBufferConfig(base, &(ptrAhbAccessConfig->buffer[0]), &(ptrAhbAccessConfig->buffer[1]),
                                  &(ptrAhbAccessConfig->buffer[2]), &(ptrAhbAccessConfig->buffer[3]));
    (void)XSPI_SetAhbReadDataSeqId(base, ptrAhbAccessConfig->ARDSeqIndex);
    (void)XSPI_EnableAhbBufferWriteFlush(base, ptrAhbAccessConfig->enableAHBBufferWriteFlush);
    XSPI_EnableAhbReadPrefetch(base, ptrAhbAccessConfig->enableAHBPrefetch);
    (void)XSPI_SetAhbAccessSplitSize(base, ptrAhbAccessConfig->ahbSplitSize);
    (void)XSPI_SetAhbAccessBoundary(base, ptrAhbAccessConfig->ahbAlignment);

    base->AWRCR &= ~(XSPI_AWRCR_PPW_RD_DIS_MASK | XSPI_AWRCR_PPW_WR_DIS_MASK);

    if (ptrAhbAccessConfig->ptrAhbWriteConfig != NULL)
    {
        (void)XSPI_BlockAccessAfterAhbWrite(base, ptrAhbAccessConfig->ptrAhbWriteConfig->blockSequenceWrite,
                                            ptrAhbAccessConfig->ptrAhbWriteConfig->blockRead);
        (void)XSPI_SelectPPWFlagClearPolicy(base, ptrAhbAccessConfig->ptrAhbWriteConfig->policy);

        (void)XSPI_UpdatePageWaitTimeCounter(base, ptrAhbAccessConfig->ptrAhbWriteConfig->pageWaitTimeoutValue);

        base->BFGENCR = (base->BFGENCR & ~(XSPI_BFGENCR_SEQID_WR_MASK | XSPI_BFGENCR_SEQID_RDSR_MASK)) |
                        XSPI_BFGENCR_SEQID_WR(ptrAhbAccessConfig->ptrAhbWriteConfig->AWRSeqIndex) |
                        XSPI_BFGENCR_SEQID_WR_EN_MASK |
                        XSPI_BFGENCR_SEQID_RDSR(ptrAhbAccessConfig->ptrAhbWriteConfig->ARDSRSeqIndex);
    }

    (void)XSPI_SetAhbErrorPayload(base, ptrAhbAccessConfig->ahbErrorPayload.highPayload,
                                  ptrAhbAccessConfig->ahbErrorPayload.lowPayload);

    return kStatus_Success;
}

/***************************** AHB Access Control Functional Interfaces End ********************************/

#if defined(FSL_DRIVER_TRANSFER_DOUBLE_WEAK_IRQ) && FSL_DRIVER_TRANSFER_DOUBLE_WEAK_IRQ
static void XSPI_CommonIRQHandler(XSPI_Type *base, xspi_handle_t *handle)
{
    uint32_t errFlags = XSPI_GetErrorStatusFlags(base);
    uint32_t flags = XSPI_GetCmdExecutionArbitrationStatusFlags(base);
    uint32_t i = 0UL;
    uint32_t bufferIndex = 0UL;
    uint8_t *buffer = NULL;
    size_t transferSize = 0UL;
    uint32_t tmpVal = 0UL;

    if ((errFlags & (uint32_t)kXSPI_ErrorTimeout) != 0UL)
    {
        XSPI_DisableInterrupts(base, (uint64_t)kXSPI_TimeoutErrIntEnable);
        XSPI_ClearErrorStatusFlags(base, (uint32_t)kXSPI_ErrorTimeout);
        XSPI_TransferAbort(base, handle);
        XSPI_ResetTgQueue(base);
        XSPI_ResetSfmAndAhbDomain(base);
        handle->completionCallback(base, handle, kStatus_Timeout, handle->userData);
    }

    if ((errFlags & (uint32_t)(kXSPI_ErrorTg0Sfar | kXSPI_ErrorTg1Sfar)) != 0UL)
    {
        XSPI_DisableInterrupts(base, (uint64_t)(kXSPI_Tg0SfarErrIntEnable | kXSPI_Tg1SfarErrIntEnable));
        XSPI_ClearErrorStatusFlags(base, (uint32_t)(kXSPI_ErrorTg0Sfar | kXSPI_ErrorTg1Sfar));
        g_IpAccessSfarFail = true;
        handle->completionCallback(base, handle, kStatus_XSPI_IpAccessAddrSettingInvalid, handle->userData);
    }

    if ((errFlags & (uint32_t)(kXSPI_ErrorTg0Ipcr | kXSPI_ErrorTg1Ipcr)) != 0UL)
    {
        XSPI_DisableInterrupts(base, (uint64_t)(kXSPI_Tg0IpcrErrIntEnable | kXSPI_Tg1IpcrErrIntEnable));
        XSPI_ClearErrorStatusFlags(base, (uint32_t)(kXSPI_ErrorTg0Ipcr | kXSPI_ErrorTg1Ipcr));
        g_IpAccessIpcrFail = true;
        handle->completionCallback(base, handle, kStatus_XSPI_IpAccessIPCRInvalid, handle->userData);
    }

    if ((errFlags & kXSPI_ArbitrationWin) != 0UL)
    {
        handle->state = kXSPI_StateIpAccessGranted;
        XSPI_ClearErrorStatusFlags(base, (uint32_t)kXSPI_ArbitrationWin);
        XSPI_DisableInterrupts(base, (uint64_t)kXSPI_ArbitrationWinIntEnable);
        return ;
    }

