Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
    if ((flags & (uint32_t)kXSPI_FlagTxBufferUnderRun) != 0UL)
    {
        XSPI_DisableInterrupts(base, (uint64_t)(kXSPI_TxBufferUnderrunIntEnable));
        XSPI_ClearCmdExecutionArbitrationStatusFlags(base, (uint32_t)kXSPI_FlagTxBufferUnderRun);
        handle->completionCallback(base, handle, kStatus_XSPI_TxBufferUnderrun, handle->userData);
    }

    if (((flags & (uint32_t)kXSPI_FlagTxBufferFill) != 0UL) && (handle->state == kXSPI_StateBusyWrite))
    {
        XSPI_ClearCmdExecutionArbitrationStatusFlags(base, (uint32_t)kXSPI_FlagTxBufferFill);
        XSPI_DisableInterrupts(base, (uint64_t)kXSPI_TxBufferFillIntEnable);
        bufferIndex = handle->transferTotalSize - handle->dataSize;
        buffer = (uint8_t *)(handle->data) + bufferIndex;
        transferSize = handle->curTransferSize;
        handle->dataSize -= transferSize;
        XSPI_ClearTxBuffer(base);
        
        base->TBCT = 256UL - ((uint32_t)transferSize / 4UL - 1UL);
        while(transferSize != 0UL)
        {
            for (i = 0UL; i < (transferSize / 4U); i++)
            {
                tmpVal = *(uint32_t *)buffer;
                base->TBDR = tmpVal;
                buffer += 4U;
            }

            transferSize -= 4U * i;

            if (transferSize != 0UL)
            {
                tmpVal = 0UL;

                for (uint32_t j = 0UL; j < transferSize; j++)
                {
                    tmpVal |= (uint32_t)*buffer++ << (8U *j);
                }

                base->TBDR = tmpVal;
            }
            transferSize = 0UL;
        }

        handle->state = kXSPI_StateIdle;
        if (handle->dataSize != 0UL)
        {
            XSPI_StartIpWriteNonBlocking(base, handle, handle->dataSize);
        }
        else
        {
            handle->completionCallback(base, handle, kStatus_XSPI_IpWriteFinished, handle->userData);
        }
    }

    if (((flags & (uint32_t)kXSPI_FlagRxBufferWatermarkExceeded) != 0UL) && (handle->state == kXSPI_StateBusyRead))
    {
        XSPI_DisableInterrupts(base, (uint64_t)kXSPI_RxBufferDrainIntEnable);
        /* RX buffer watermark exceeded, read data to buffer and pop RX buffer. */
        uint32_t rxDataSize = XSPI_GetRxBufferAvailableBytesCount(base);
        uint32_t rxBufferWaterMark = base->RBCT + 1UL;
        bufferIndex = handle->transferTotalSize - handle->dataSize;
        buffer = (uint8_t *)(handle->data) + bufferIndex;

        handle->dataSize -= rxDataSize;
        while(rxDataSize != 0UL)
        {
            if (rxDataSize >= 4UL * rxBufferWaterMark)
            {
                uint32_t removedCount = XSPI_GetRxBufferRemovedBytesCount(base);
                for (i = 0UL; i < rxBufferWaterMark; i++)
                {
                    *(uint32_t *)buffer = base->RBDR[i];
                    buffer += 4UL;
                }

                XSPI_TriggerRxBufferPopEvent(base);

                while((XSPI_GetRxBufferRemovedBytesCount(base) - removedCount) != (rxBufferWaterMark * 4UL))
                {}
                rxDataSize = rxDataSize - 4UL * rxBufferWaterMark;
            }
            else
            {
                for (i = 0UL; i < (rxDataSize / 4UL); i++)
                {
                    *(uint32_t *)buffer = base->RBDR[i];
                    buffer += 4UL;
                }

                rxDataSize -= 4UL * i;

                if (rxDataSize != 0UL)
                {
                    tmpVal = base->RBDR[i];

                    for (i = 0U; i < rxDataSize; i++)
                    {
                        *buffer++ = ((uint8_t)(tmpVal >> (8U * i)) & 0xFFU);
                    }
                }
            }
        }

        XSPI_ClearCmdExecutionArbitrationStatusFlags(base, kXSPI_FlagRxBufferWatermarkExceeded);
        handle->state = kXSPI_StateIdle;
        if (handle->dataSize != 0UL)
        {
            XSPI_StartIpReadNonBlocking(base, handle, handle->dataSize);
        }
        else
        {
            handle->completionCallback(base, handle, kStatus_XSPI_IpReadFinished, handle->userData);
        }
    }
}

#if defined(XSPI0)
void XSPI0_DriverIRQHandler(void);
void XSPI0_DriverIRQHandler(void)
{
    XSPI_CommonIRQHandler(XSPI0, s_xspiHandle[0]);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* defined(XSPI0) */

#if defined(XSPI1)
void XSPI1_DriverIRQHandler(void);
void XSPI1_DriverIRQHandler(void)
{
    XSPI_CommonIRQHandler(XSPI1, s_xspiHandle[1]);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* defined(XSPI1) */

#if defined(XSPI2)
void XSPI2_DriverIRQHandler(void);
void XSPI2_DriverIRQHandler(void)
{
    XSPI_CommonIRQHandler(XSPI2, s_xspiHandle[2]);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* defined(XSPI2) */
#endif /* defined(FSL_DRIVER_TRANSFER_DOUBLE_WEAK_IRQ) && FSL_DRIVER_TRANSFER_DOUBLE_WEAK_IRQ */

#if defined(CACHE64_CTRL0_BASE)

static uint32_t XSPI_Cache64_GetInstanceByAddr(uint32_t address)
{
    uint32_t i = 0UL;
    uint32_t phyMemBase[] = CACHE64_CTRL_PHYMEM_BASES;
    uint32_t phyMemSize[] = CACHE64_CTRL_PHYMEM_SIZES;
    CACHE64_CTRL_Type *const s_xspi_cache64ctrlBases[] = CACHE64_CTRL_BASE_PTRS;

    while(i < ARRAY_SIZE(s_xspi_cache64ctrlBases))
    {
        if ((MSDK_REG_SECURE_ADDR(address) >= MSDK_REG_SECURE_ADDR(phyMemBase[i])) && (MSDK_REG_SECURE_ADDR(address) < MSDK_REG_SECURE_ADDR(phyMemBase[i] + phyMemSize[i] - 0x01U)))
        {
            return i;
        }

        i++;
    }
		
    assert(false);
    return 0xFFFFFFFFUL;
}

/*!
 * brief Enable a Cache64 instance.
 * 
 * param base CACHE64_CTRL peripheral base address.
 */
void XSPI_Cache64_EnableCache(CACHE64_CTRL_Type *base)
{
    /* if CACHE is not enabled */
    if ((base->CCR & CACHE64_CTRL_CCR_ENCACHE_MASK) == 0x00U)
    {
        /* First, invalidate the entire cache. */
        XSPI_Cache64_InvalidateCache(base);

        /* Now enable the cache. */
        base->CCR |= CACHE64_CTRL_CCR_ENCACHE_MASK;
    }
}

/*!
 * brief Disable a Cache64 instance.
 * 
 * param base CACHE64_CTRL peripheral base address.
 */
void XSPI_Cache64_DisableCache(CACHE64_CTRL_Type *base)
{
    /* if CACHE is enabled */
    if ((base->CCR & CACHE64_CTRL_CCR_ENCACHE_MASK) != 0x00U)
    {
        /* First, push any modified contents. */
        XSPI_Cache64_CleanCache(base);

        /* Now disable the cache. */
        base->CCR &= ~CACHE64_CTRL_CCR_ENCACHE_MASK;
    }
}

/*!
 * brief Invalidate whole input cache64 instance.
 * 
 * param base CACHE64_CTRL peripheral base address.
 */
void XSPI_Cache64_InvalidateCache(CACHE64_CTRL_Type *base)
{
    /* Invalidate all lines in both ways and initiate the cache command. */
    base->CCR |= CACHE64_CTRL_CCR_INVW0_MASK | CACHE64_CTRL_CCR_INVW1_MASK | CACHE64_CTRL_CCR_GO_MASK;

    /* Wait until the cache command completes. */
    while ((base->CCR & CACHE64_CTRL_CCR_GO_MASK) != 0x00U)
    {
    }

