Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
    /* As a precaution clear the bits to avoid inadvertently re-running this command. */
    base->CCR &= ~(CACHE64_CTRL_CCR_INVW0_MASK | CACHE64_CTRL_CCR_INVW1_MASK);
}

/*!
 * brief Invalidate cache64 instance based on address of size.
 * 
 * param address The value of start physical address.
 * param size Size of data in unit of byte.
 */
void XSPI_Cache64_InvalidateCacheByRange(uint32_t address, size_t size)
{
    if (size > 0UL)
    {
        uint32_t endAddr = MSDK_REG_SECURE_ADDR(address + size - 0x01U);
        uint32_t pccReg  = 0;
        /* Align address to cache line size. */
        uint32_t startAddr = MSDK_REG_SECURE_ADDR(address & ~((uint32_t)FSL_FEATURE_CACHE64_LINESIZE_BYTE - 1U));
        uint32_t instance  = XSPI_Cache64_GetInstanceByAddr(address);
        uint32_t endLim;
        CACHE64_CTRL_Type *base;
        uint32_t phyMemBase[] = CACHE64_CTRL_PHYMEM_BASES;
        uint32_t phyMemSize[] = CACHE64_CTRL_PHYMEM_SIZES;
        CACHE64_CTRL_Type *const s_xspi_cache64ctrlBases[] = CACHE64_CTRL_BASE_PTRS;

        if (instance >= ARRAY_SIZE(s_xspi_cache64ctrlBases))
        {
            return;
        }
        base    = s_xspi_cache64ctrlBases[instance];
        endLim  = MSDK_REG_SECURE_ADDR(phyMemBase[instance] + phyMemSize[instance] - 0x01U);
        endAddr = endAddr > endLim ? endLim : endAddr;

        /* Set the invalidate by line command and use the physical address. */
        pccReg = (base->CLCR & ~CACHE64_CTRL_CLCR_LCMD_MASK) | CACHE64_CTRL_CLCR_LCMD(1) | CACHE64_CTRL_CLCR_LADSEL_MASK;
        base->CLCR = pccReg;

        while (startAddr < endAddr)
        {
            /* Set the address and initiate the command. */
            base->CSAR = (startAddr & CACHE64_CTRL_CSAR_PHYADDR_MASK) | CACHE64_CTRL_CSAR_LGO_MASK;

            /* Wait until the cache command completes. */
            while ((base->CSAR & CACHE64_CTRL_CSAR_LGO_MASK) != 0x00U)
            {
            }
            startAddr += (uint32_t)FSL_FEATURE_CACHE64_LINESIZE_BYTE;
        }
    }
}

/*!
 * brief Clean whole input cache64 instance.
 * 
 * param base CACHE64_CTRL peripheral base address.
 */
void XSPI_Cache64_CleanCache(CACHE64_CTRL_Type *base)
{
    /* Enable the to push all modified lines. */
    base->CCR |= CACHE64_CTRL_CCR_PUSHW0_MASK | CACHE64_CTRL_CCR_PUSHW1_MASK | CACHE64_CTRL_CCR_GO_MASK;

    /* Wait until the cache command completes. */
    while ((base->CCR & CACHE64_CTRL_CCR_GO_MASK) != 0x00U)
    {
    }

    /* As a precaution clear the bits to avoid inadvertently re-running this command. */
    base->CCR &= ~(CACHE64_CTRL_CCR_PUSHW0_MASK | CACHE64_CTRL_CCR_PUSHW1_MASK);
}

/*!
 * brief Clean cache64 instance based on address of size.
 * 
 * param address The value of start physical address.
 * param size Size of data in unit of byte.
 */
void XSPI_Cache64_CleanCacheByRange(uint32_t address, size_t size)
{
    if (size > 0UL)
    {
        uint32_t endAddr = MSDK_REG_SECURE_ADDR(address + size - 0x01U);
        uint32_t pccReg  = 0;
        /* Align address to cache line size. */
        uint32_t startAddr = MSDK_REG_SECURE_ADDR(address & ~((uint32_t)FSL_FEATURE_CACHE64_LINESIZE_BYTE - 1U));
        uint32_t instance  = XSPI_Cache64_GetInstanceByAddr(address);
        uint32_t endLim;
        CACHE64_CTRL_Type *base;
        uint32_t phyMemBase[] = CACHE64_CTRL_PHYMEM_BASES;
        uint32_t phyMemSize[] = CACHE64_CTRL_PHYMEM_SIZES;
        CACHE64_CTRL_Type *const s_xspi_cache64ctrlBases[] = CACHE64_CTRL_BASE_PTRS;

        if (instance >= ARRAY_SIZE(s_xspi_cache64ctrlBases))
        {
            return;
        }
        base    = s_xspi_cache64ctrlBases[instance];
        endLim  = MSDK_REG_SECURE_ADDR(phyMemBase[instance] + phyMemSize[instance] - 0x01U);
        endAddr = endAddr > endLim ? endLim : endAddr;

        /* Set the push by line command. */
        pccReg = (base->CLCR & ~CACHE64_CTRL_CLCR_LCMD_MASK) | CACHE64_CTRL_CLCR_LCMD(2) | CACHE64_CTRL_CLCR_LADSEL_MASK;
        base->CLCR = pccReg;

        while (startAddr < endAddr)
        {
            /* Set the address and initiate the command. */
            base->CSAR = (startAddr & CACHE64_CTRL_CSAR_PHYADDR_MASK) | CACHE64_CTRL_CSAR_LGO_MASK;

            /* Wait until the cache command completes. */
            while ((base->CSAR & CACHE64_CTRL_CSAR_LGO_MASK) != 0x00U)
            {
            }
            startAddr += (uint32_t)FSL_FEATURE_CACHE64_LINESIZE_BYTE;
        }
    }
}

/*!
 * brief Clean and Invalidate whole input cache64 instance.
 * 
 * param base CACHE64_CTRL peripheral base address.
 */
void XSPI_Cache64_CleanInvalidateCache(CACHE64_CTRL_Type *base)
{
    /* Push and invalidate all. */
    base->CCR |= CACHE64_CTRL_CCR_PUSHW0_MASK | CACHE64_CTRL_CCR_PUSHW1_MASK | CACHE64_CTRL_CCR_INVW0_MASK |
                 CACHE64_CTRL_CCR_INVW1_MASK | CACHE64_CTRL_CCR_GO_MASK;

    /* Wait until the cache command completes. */
    while ((base->CCR & CACHE64_CTRL_CCR_GO_MASK) != 0x00U)
    {
    }

    /* As a precaution clear the bits to avoid inadvertently re-running this command. */
    base->CCR &= ~(CACHE64_CTRL_CCR_PUSHW0_MASK | CACHE64_CTRL_CCR_PUSHW1_MASK | CACHE64_CTRL_CCR_INVW0_MASK |
                   CACHE64_CTRL_CCR_INVW1_MASK);
}

/*!
 * brief Clean and invalidate cache64 instance based on address of size.
 * 
 * param address The value of start physical address.
 * param size Size of data in unit of byte.
 */
void XSPI_Cache64_CleanInvalidateByRange(uint32_t address, size_t size)
{
    if (size > 0UL)
    {
        uint32_t endAddr = MSDK_REG_SECURE_ADDR(address + size - 0x01U);
        uint32_t pccReg  = 0;
        /* Align address to cache line size. */
        uint32_t startAddr = MSDK_REG_SECURE_ADDR(address & ~((uint32_t)FSL_FEATURE_CACHE64_LINESIZE_BYTE - 1U));
        uint32_t instance  = XSPI_Cache64_GetInstanceByAddr(address);
        uint32_t endLim;
        CACHE64_CTRL_Type *base;
        uint32_t phyMemBase[] = CACHE64_CTRL_PHYMEM_BASES;
        uint32_t phyMemSize[] = CACHE64_CTRL_PHYMEM_SIZES;
        CACHE64_CTRL_Type *const s_xspi_cache64ctrlBases[] = CACHE64_CTRL_BASE_PTRS;

        if (instance >= ARRAY_SIZE(s_xspi_cache64ctrlBases))
        {
            return;
        }
        base    = s_xspi_cache64ctrlBases[instance];
        endLim  = MSDK_REG_SECURE_ADDR(phyMemBase[instance] + phyMemSize[instance] - 0x01U);
        endAddr = endAddr > endLim ? endLim : endAddr;

        /* Set the push by line command. */
        pccReg = (base->CLCR & ~CACHE64_CTRL_CLCR_LCMD_MASK) | CACHE64_CTRL_CLCR_LCMD(3) | CACHE64_CTRL_CLCR_LADSEL_MASK;
        base->CLCR = pccReg;

