Masmiseim36/iMXRT/targets/iMXRText/Loader2/drivers/fsl_xspi.c
        while (startAddr < endAddr)
        {
            /* Set the address and initiate the command. */
            base->CSAR = (startAddr & CACHE64_CTRL_CSAR_PHYADDR_MASK) | CACHE64_CTRL_CSAR_LGO_MASK;

            /* Wait until the cache command completes. */
            while ((base->CSAR & CACHE64_CTRL_CSAR_LGO_MASK) != 0x00U)
            {
            }
            startAddr += (uint32_t)FSL_FEATURE_CACHE64_LINESIZE_BYTE;
        }
    }
}

/*!
 * brief Read data from cache.
 * 
 * param address The value of start physical address.
 *
 * return uint32_t The data of input physical address stored in cache.
 */
uint32_t XSPI_Cache64_ReadCache(uint32_t address)
{
    CACHE64_CTRL_Type *const s_xspi_cache64ctrlBases[] = CACHE64_CTRL_BASE_PTRS;
    uint32_t instance = XSPI_Cache64_GetInstanceByAddr(address);
    CACHE64_CTRL_Type *base = s_xspi_cache64ctrlBases[instance];

    base->CLCR &= ~(CACHE64_CTRL_CLCR_LCMD_MASK | CACHE64_CTRL_CLCR_LACC_MASK);
    base->CLCR |= CACHE64_CTRL_CLCR_LADSEL_MASK;

    base->CSAR = CACHE64_CTRL_CSAR_PHYADDR27_1(address) | CACHE64_CTRL_CSAR_LGO_MASK;
    while(((base->CSAR) & CACHE64_CTRL_CSAR_LGO_MASK) != 0UL)
    {}

    return (uint32_t)(base->CCVR);
}
#endif /* defined(CACHE64_CTRL0_BASE) */

#if (defined(FSL_FEATURE_SOC_CACHE64_POLSEL_COUNT) && (FSL_FEATURE_SOC_CACHE64_POLSEL_COUNT > 0))
static uint32_t XSPI_Cache64_GetPolselInstance(CACHE64_POLSEL_Type *base)
{
    uint32_t i;
    CACHE64_POLSEL_Type *const xspi_cache64polselBases[] = CACHE64_POLSEL_BASE_PTRS;

    for (i = 0UL; i < ARRAY_SIZE(xspi_cache64polselBases); i++)
    {
        if (MSDK_REG_SECURE_ADDR(base) == MSDK_REG_SECURE_ADDR(xspi_cache64polselBases[i]))
        {
            break;
        }
    }

    assert(i < ARRAY_SIZE(xspi_cache64polselBases));

    return i;
}

/*!
 * brief Set policy of cache regions.
 * 
 * param base CACHE64_POLSEL peripheral base address.
 * param config Pointer to the structure xspi_cache64_region_config_t.
 */
void XSPI_Cache64_SetRegionConfig(CACHE64_POLSEL_Type *base, xspi_cache64_region_config_t *config)
{
    assert(config != NULL);

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
#ifdef CACHE64_CLOCKS
    uint32_t instance = XSPI_Cache64_GetPolselInstance(base);

    /* Enable CACHE64 clock */
    CLOCK_EnableClock(s_xspi_cache64Clocks[instance]);
#endif
#endif

    base->REG0_TOP = config->region0TopAddr & 0x3FFUL;
    base->REG1_TOP = config->region1TopAddr & 0x3FFUL;

    base->POLSEL = CACHE64_POLSEL_POLSEL_REG0_POLICY(config->region0Policy) |
             CACHE64_POLSEL_POLSEL_REG1_POLICY(config->region1Policy) |
             CACHE64_POLSEL_POLSEL_REG2_POLICY(config->region2Policy);
}
#endif 
